{
  "app": {
    "id": 389801252,
    "title": "Instagram",
    "developer": "Instagram, Inc.",
    "rating": "4.69105",
    "ratingCount": 28204600,
    "price": "Free",
    "category": "Photo & Video",
    "description": "Little moments lead to big friendships. Share yours on Instagram. \n— From Meta\n\nConnect with friends, find other fans, and see what people around you are up to and into. Explore your interests and post what's going on, from your daily moments to life's highlights.\n\nShare what you’re up to and into:\n- Turn your life into a movie and discover short, entertaining videos on Instagram with Reels.\n- Keep up with friends on the fly with Stories and Notes that disappear after 24 hours.\n- Start group chats and share unfiltered moments with your Close Friends.\n- Share memories from recent events or trips in Feed.\n- Customize your posts with exclusive templates, music, stickers and filters.\n\nDive into your interests.\n- Watch videos from your favorite creators and discover new content that’s personalized to your interests.\n- Get inspired by photos and videos from new accounts in Explore.\n- Discover brands and small businesses, and shop products that are relevant to your personal style.\n\nSome Instagram features may not be available in your country or region.\n\nTerms and Policies: https://help.instagram.com/581066165581870\n\nConsumer Health Privacy Policy: https://privacycenter.instagram.com/policies/health\n\nLearn how we're working to help keep our communities safe across Meta technologies at the Instagram Safety Center: https://about.instagram.com/safety",
    "appUrl": "https://apps.apple.com/us/app/instagram/id389801252?uo=4",
    "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/7f/df/7c/7fdf7c64-d78d-33ca-707f-e2147e91e498/Prod-0-0-1x_U007epad-0-1-0-sRGB-85-220.png/100x100bb.jpg"
  },
  "reviews": [
    {
      "author": "Mrhiej",
      "rating": "1",
      "title": "Unfairly banning users",
      "content": "Currently there is a large class action lawsuit and over 40k on a petition. People are getting falsely banned for horrible accusations!",
      "date": "2025-10-02T20:15:17-07:00",
      "version": "400.1.0"
    },
    {
      "author": "WUNTER..68$39",
      "rating": "1",
      "title": "🤦🏽‍♀️",
      "content": "This app needs to be fixed it is worried about the wrong things, and people they're suspending/deleting the wrong peoples accounts, they are focused on how many times a person you follow has changed their username,and marks them as a potential scam, and when you ignpre it too many times they will eventually suspend/delete your account, and appealing it doesn't get your account back, and after it suspends one of your accounts and you try to make another with the same number it suspends that one too, everyone please don't download this app.",
      "date": "2025-10-02T20:13:17-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Stop banning m3",
      "rating": "1",
      "title": "Instagram",
      "content": "They have suspended my account for no reason and I can't get it back",
      "date": "2025-10-02T20:08:49-07:00",
      "version": "400.1.0"
    },
    {
      "author": "gavlanierf05",
      "rating": "1",
      "title": "Incredibly buggy",
      "content": "I was wrongfully permanently banned. After looking online, it appears that this is a huge issue affecting other people as well. Instagram has taken no steps to correct this issue.",
      "date": "2025-10-02T20:06:10-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Imperial nate",
      "rating": "1",
      "title": "Why is my account compromised?",
      "content": "I can’t use this app anymore because my account got compromised for what \nplease fix this",
      "date": "2025-10-02T20:04:28-07:00",
      "version": "400.1.0"
    },
    {
      "author": "javierrres123",
      "rating": "1",
      "title": "It keeps restricting my account for no reason",
      "content": "I didn’t do nothing wrong I just use it to text ppl or see vids and I keep getting my account restricted for no reason I just got a new phone nd new number and i was making an account and once’s I made it and automatically restricted its annoying that it keeps doing that for no reason.",
      "date": "2025-10-02T20:02:09-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Smhinsta",
      "rating": "1",
      "title": "Delete the repost",
      "content": "Why am I accidentally clicking repost? Because you decided to put repost on where people scroll. Move it or delete it",
      "date": "2025-10-02T19:54:34-07:00",
      "version": "400.1.0"
    },
    {
      "author": "TETE_33",
      "rating": "5",
      "title": "Getting banned/suspended for no reason",
      "content": "I had sent my friend a reel like I usually do. My friend wasn’t able to see the video it had said “unavailable” there was nothing wrong with the reel i had sent her. It was just a funny relatable reel. When i tired sending it to her again it had said my account was being suspended. I didn’t understand because haven’t done anything wrong. Then it had asked me to take a video of myself to confirm its a real person. I had created another acc did the something. This is just very unexpected able. INSTAGRAM needs to FIXS this issue and STOP banning/ suspending peoples accounts for no REASON!.",
      "date": "2025-10-02T19:54:28-07:00",
      "version": "400.1.0"
    },
    {
      "author": "MRLWS1",
      "rating": "5",
      "title": "Great App",
      "content": "Instagram is a great app!",
      "date": "2025-10-02T19:54:19-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Deneiyah",
      "rating": "5",
      "title": "Posting",
      "content": "Thanks for the great activitys and things we can do on instagram but may please add a little more things thank you 🙂",
      "date": "2025-10-02T19:48:03-07:00",
      "version": "400.1.0"
    },
    {
      "author": "gillianjewelle03",
      "rating": "3",
      "title": "Invite collaborators",
      "content": "If I invite a collaborator to a post, once they accept, they should have the option to repost it/share it to their facebook. Especially on and between business accounts. You can have an approval question asking the original poster if the collaborator can share to other socials like threads and facebook!!",
      "date": "2025-10-02T19:41:01-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Ai_liltop",
      "rating": "5",
      "title": "My login",
      "content": "So I tried logging in my account and even tried facebook my username is ai_lostsoul21 and every time I tried to change change the password to get it back it will say password incorrect like if I was trying to login in so I restarted the app a couple times and turned off my phone and it’s just the same thing over and over if there’s anyway y’all can help me login that will be great and I love the app (don’t tell TikTok but it’s better than it) thank you",
      "date": "2025-10-02T19:40:35-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Yiyi 1995",
      "rating": "5",
      "title": "Me encanta instagram",
      "content": "Genial",
      "date": "2025-10-02T19:29:00-07:00",
      "version": "400.1.0"
    },
    {
      "author": "INCREDIBLE TECH!",
      "rating": "5",
      "title": "Classy and fun all at the same time!!",
      "content": "I am not a gamer but I am after playing at Ava’s wine bar! A lot of fun and money!",
      "date": "2025-10-02T19:28:02-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Darius926",
      "rating": "1",
      "title": "Darius Moreno",
      "content": "Instagram is stupid. Don't know why I got banned.",
      "date": "2025-10-02T19:28:00-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Bluestudio3783",
      "rating": "5",
      "title": "Love sharing my lifestyle! Thank you!!",
      "content": "Easiest way to share my lifestyle!",
      "date": "2025-10-02T19:24:37-07:00",
      "version": "400.1.0"
    },
    {
      "author": "raaachelmaine",
      "rating": "1",
      "title": "ENOUGH WITH THE ADS",
      "content": "Why are there 50000 ads in between every single story???!!!!!! ENOUGH",
      "date": "2025-10-02T19:21:31-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Eazye balla",
      "rating": "3",
      "title": "Do better",
      "content": "They took my account down for no reason at all and I couldn’t even get it back they justi taking people accounts to be honest if we can’t get our accounts we might as well go back to Snapchat y’all they playing around I made over 7 accounts some I can’t log in some get deleted and I don’t anything TikTok is better than instagram now",
      "date": "2025-10-02T19:13:01-07:00",
      "version": "400.1.0"
    },
    {
      "author": "choey545",
      "rating": "4",
      "title": "Evil, on purpose",
      "content": "Waste, fraud, and abuse!!!\nAnyone offering Medicare insurance knows this line!!!\nWaste is when you cut benefits for those less fortunate than you and build a 200million dollar ball room next to the White House!!!\nFraud is when you do something that will benefit you and probably only you, you know it’s wrong, but you do it anyway!!!\nAbuse is when you absolutely ruin someone, or a bunch of someones, just because you can!!! “Because you’re rich, they let you”!!! But you notice, in every scenario, someone suffers! What is it with you Repuglicans! Why do you need someone to suffer for you to do well!!! I’ll leave you with this!\nYour anger and hatred is directed at the wrong people! \nI don’t have your money! But I Know who does!!! And they need a reason to pass it around!!!\nDon’t wait for the government!\nYou can do it!!! Have a contest!\nSee who can help the neediest people in America and change their lives!! Wal-mart, you start!!!\nTake2% of your gross last year and pass it back to your employees! The employee working for you who makes the least gets the largest bonus and it lessens as it goes up the organization til the CEO gets one penny! Taxing it!!!\nFor the company, complete deduction!!! For the people, taxed at 2%! Watch this economy take off!!! And keep doing it!! Share your business with your employees!!! It will pay off in more ways than you know!!! And one more thing!\nNo more!\nWASTE,FRAUD,and ABUSE!!!",
      "date": "2025-10-02T18:58:49-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Angie win .",
      "rating": "3",
      "title": "insta suspension .",
      "content": "i had insta for like a few years since i was 13 , and im 19 now . & my account got suspended and disabled , and i been trying to make new accounts after new ones & it still gets me a warning as suspension . i make a new acc and change a new email or gmail still doesn’t work . & it happens to most people not just only me . other than that please fix my ACCOUNT .. Instagram or META AI . thanks !",
      "date": "2025-10-02T18:56:06-07:00",
      "version": "400.1.0"
    },
    {
      "author": "ironsipder7",
      "rating": "5",
      "title": "I like reels",
      "content": "I love to doomscroll and see femboys on my feed 24/7, keep up the good work femboy posters",
      "date": "2025-10-02T18:48:37-07:00",
      "version": "400.1.0"
    },
    {
      "author": "geoluv",
      "rating": "1",
      "title": "Only want you to watch reels so they can blast you with ads",
      "content": "You can no longer tap a commenter’s name to go to their page to check out their wall posts.  You tap their name and nothing happens, all you can do is tap their avatar which takes you to their stories.  Instagram is doing this because every second you spend on scrolling stories/reels or scrolling your feed lets them blast you with ads and every second you spend checking out other users accounts and looking at wall posts is lost ad revenue for meta.  The whole point of “social media” is to make social connection with other people.  Meta is destroying the social connectivity aspect of Instagram in order to keep you doomscrolling so they can blast ads at you.  This is a very up front and obvious example of how tech companies are actually devolving social media into a perverse profit-above-all-else social experiment.",
      "date": "2025-10-02T18:29:00-07:00",
      "version": "400.1.0"
    },
    {
      "author": "emoni r",
      "rating": "3",
      "title": "..",
      "content": "im ngl , yal b suspending peole for no reason onnis app but hey , its a coo app",
      "date": "2025-10-02T18:22:52-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Briaaa💞",
      "rating": "1",
      "title": "Logging into my account",
      "content": "I keep trying to log into my account, but when I try to log into my account, it goes to another screen and it says “ enter password” but when I enter my password, it says that it is wrong. I emailed you guys and I am waiting for you guys to email me back. Please fix this. I’ve been trying to do this since yesterday. I am tired. This is the only app I can communicate people on, and I cannot log into my account changed the password multiple times and I cannot log please respond to this and help me login to my account. Please and thank you.",
      "date": "2025-10-02T18:12:18-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Prettyface_.diamond_",
      "rating": "1",
      "title": ".",
      "content": "They keep banning my account for nothing so you should not get this app if u want that",
      "date": "2025-10-02T18:00:58-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Flyfisherz3",
      "rating": "1",
      "title": "EASY TO HACK",
      "content": "no way to stop hackers",
      "date": "2025-10-02T17:59:27-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Chichi6678",
      "rating": "1",
      "title": "Can’t scroll down my feed",
      "content": "Ever since the new iPhone update I get the “try again” error message when trying to scroll down my feed",
      "date": "2025-10-02T17:53:55-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Asianotas1an",
      "rating": "1",
      "title": "Why",
      "content": "I woke up to my account suspended saying i was violating the terms n i didn’t do nothing not only did my account with all my friends get deleted my other 2 accounts too its ridiculous cuz i got multiple people who account suspended for false accusations yall need to fix yall app this is beyond ridiculous i have memories on that account please give my account back thank you",
      "date": "2025-10-02T17:52:26-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Youraweridoinstagram",
      "rating": "1",
      "title": "Ban FOR NO REASON",
      "content": "I hate how you banned me for no reason just give me my acc back lil bro PLEASe 🙎🏻‍♀️🙏🏻",
      "date": "2025-10-02T17:40:12-07:00",
      "version": "400.1.0"
    },
    {
      "author": "JayJay__Lol",
      "rating": "5",
      "title": "Uhhh it’s okay",
      "content": "The app itself is okay the community toxic asl boom done",
      "date": "2025-10-02T17:38:44-07:00",
      "version": "400.1.0"
    },
    {
      "author": "-----help---------------",
      "rating": "1",
      "title": "iPad update: Auto scrolling stories is ANNOYING",
      "content": "This iPad update is TERRIBLE.\nPlease. Fix it. I can’t stay on a persons stories without going to their account. Stories are the only part of instagram that I use. This new layout is lame as well. The most “anti-user friendly” update ever.",
      "date": "2025-10-02T17:34:13-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Lolollilkikanab",
      "rating": "1",
      "title": "Dumb app",
      "content": "If you sign out you can’t sign in anymore it doesn’t even send a code to your phone number terrible service",
      "date": "2025-10-02T17:23:42-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Ale LLNM",
      "rating": "5",
      "title": "Good for business",
      "content": "Great for business ❤️❤️❤️",
      "date": "2025-10-02T17:18:44-07:00",
      "version": "400.1.0"
    },
    {
      "author": "kevin chuk",
      "rating": "1",
      "title": "Second TikTok",
      "content": "With the latests update the home tab is now nothing but reels and time wasters. I really wish I could control what I see and for there to be a dedicated ‘only pictures’ tab.",
      "date": "2025-10-02T17:15:58-07:00",
      "version": "400.1.0"
    },
    {
      "author": "I466ff4",
      "rating": "1",
      "title": "Wrongly disabled",
      "content": "I’m very disappointed with Instagram right now. My accounts (@indirahh._ and @yesitsdirah) were wrongfully banned even though I didn’t break any guidelines. I had these accounts for months with no issues, and then they were suddenly taken down. I’ve tried appealing but haven’t gotten any real help or explanation. It feels unfair because I see many other users with similar usernames and content who are not banned. Instagram should review bans more carefully and actually listen when people say they were suspended by mistake.",
      "date": "2025-10-02T16:50:59-07:00",
      "version": "400.1.0"
    },
    {
      "author": "iSpect8_",
      "rating": "2",
      "title": "I can’t go LIVE on Instagram",
      "content": "Please update to go to LIVE again on IG again please",
      "date": "2025-10-02T16:48:15-07:00",
      "version": "400.1.0"
    },
    {
      "author": "grace_t26",
      "rating": "1",
      "title": "banned for no reason",
      "content": "kindly reinstate my account. i have had it for 6 years. if not, please provide the exact reason and piece of media for which i was banned.\n\ni will fix the review once my account is back.",
      "date": "2025-10-02T16:45:57-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Stephen Githara",
      "rating": "1",
      "title": "Meta will ban you for no reason and has no support whatsoever",
      "content": "I have used Instagram for almost 10 years now and this past Saturday I was wrongly banned for CSE by Meta’s faulty AI system. Immediately emailed Meta and get no response. As of the time I’m writing this, a human being has not reviewed my account yet and I’ve exhausted all avenues of communication with Meta. I’ve even purchased Meta Verified to speak to Meta Support and still no one has reviewed my account to see I’ve done nothing wrong. This isn’t just happening to me, but thousands of accounts. Don’t get this app unless you want to get banned for no reason whatsoever.",
      "date": "2025-10-02T16:40:02-07:00",
      "version": "400.1.0"
    },
    {
      "author": "twglolulu",
      "rating": "1",
      "title": "Friends",
      "content": "I don’t like that instagram limit things of what I can see, like someone’s followers or following list that not very protect their community fix  that please and thank you",
      "date": "2025-10-02T16:32:49-07:00",
      "version": "400.1.0"
    },
    {
      "author": "tootltttes",
      "rating": "1",
      "title": "Account banned for no reason",
      "content": "Accounts are getting banned with no way to access support. Just Terrible",
      "date": "2025-10-02T16:30:11-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Aramesh rezvan80",
      "rating": "5",
      "title": "Aramesh",
      "content": "Rezvan80",
      "date": "2025-10-02T16:29:34-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Dumbassapp05",
      "rating": "1",
      "title": "Banned",
      "content": "Ya’ll wrong accused dnd banned people",
      "date": "2025-10-02T16:26:10-07:00",
      "version": "400.1.0"
    },
    {
      "author": "R - Meta",
      "rating": "1",
      "title": "Account wrongfully suspended",
      "content": "Instagram account suspended with zero evidence of any wrong doing. There is no way to refute any claims made. Please fix this issue.",
      "date": "2025-10-02T16:21:29-07:00",
      "version": "400.1.0"
    },
    {
      "author": "SSSChen",
      "rating": "1",
      "title": "Main page",
      "content": "Could you please have an option to make the pictures square again on the main page?",
      "date": "2025-10-02T16:19:45-07:00",
      "version": "400.1.0"
    },
    {
      "author": "vamshii26",
      "rating": "1",
      "title": "Suspended for no reason",
      "content": "Suspended for no reason",
      "date": "2025-10-02T16:11:36-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Seily Perez",
      "rating": "1",
      "title": "Account taking",
      "content": "YOU KEEP TAKING MY ACCOUNTS FOR NO REASON . And I can’t even keep an account for 3 minutes without you suspending it .",
      "date": "2025-10-02T16:05:54-07:00",
      "version": "400.1.0"
    },
    {
      "author": "aidan morin",
      "rating": "5",
      "title": "aidan",
      "content": "it keeps on suspended all my accounts for no reason",
      "date": "2025-10-02T15:47:38-07:00",
      "version": "400.1.0"
    },
    {
      "author": "hurrem16483",
      "rating": "5",
      "title": "топ",
      "content": "сейчас вообще все стало круче чем раньше!! огромное спасибо за то что фотки сейчас не обрезаются если их много, и алгоритмы в рилсах супер короче пупсики возвращайтесь в россию матушку💋🙏",
      "date": "2025-10-02T15:42:14-07:00",
      "version": "400.1.0"
    },
    {
      "author": "Daily.Homegrown",
      "rating": "3",
      "title": "Insta",
      "content": "Would be better if they didn’t limit the canna community and flag profiles limiting social interaction with peers",
      "date": "2025-10-02T15:34:09-07:00",
      "version": "400.1.0"
    }
  ],
  "exportInfo": {
    "totalReviews": 49,
    "exportedReviews": 49,
    "exportDate": "2025-10-04T11:03:34.609Z",
    "country": "us",
    "appId": "389801252"
  }
}