{
  "summary": {
    "totalApps": 10,
    "successfulApps": 10,
    "totalReviews": 490,
    "exportDate": "2025-10-04T11:04:04.366Z",
    "country": "us"
  },
  "apps": [
    {
      "id": 389801252,
      "title": "Instagram",
      "developer": "Instagram, Inc.",
      "rating": "4.69105",
      "ratingCount": 28204600,
      "price": "Free",
      "category": "Photo & Video",
      "description": "Little moments lead to big friendships. Share yours on Instagram. \n— From Meta\n\nConnect with friends, find other fans, and see what people around you are up to and into. Explore your interests and post what's going on, from your daily moments to life's highlights.\n\nShare what you’re up to and into:\n- Turn your life into a movie and discover short, entertaining videos on Instagram with Reels.\n- Keep up with friends on the fly with Stories and Notes that disappear after 24 hours.\n- Start group chats and share unfiltered moments with your Close Friends.\n- Share memories from recent events or trips in Feed.\n- Customize your posts with exclusive templates, music, stickers and filters.\n\nDive into your interests.\n- Watch videos from your favorite creators and discover new content that’s personalized to your interests.\n- Get inspired by photos and videos from new accounts in Explore.\n- Discover brands and small businesses, and shop products that are relevant to your personal style.\n\nSome Instagram features may not be available in your country or region.\n\nTerms and Policies: https://help.instagram.com/581066165581870\n\nConsumer Health Privacy Policy: https://privacycenter.instagram.com/policies/health\n\nLearn how we're working to help keep our communities safe across Meta technologies at the Instagram Safety Center: https://about.instagram.com/safety",
      "appUrl": "https://apps.apple.com/us/app/instagram/id389801252?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/7f/df/7c/7fdf7c64-d78d-33ca-707f-e2147e91e498/Prod-0-0-1x_U007epad-0-1-0-sRGB-85-220.png/100x100bb.jpg"
    },
    {
      "id": 310633997,
      "title": "WhatsApp Messenger",
      "developer": "WhatsApp Inc.",
      "rating": "4.69194",
      "ratingCount": 16565819,
      "price": "Free",
      "category": "Social Networking",
      "description": "WhatsApp from Meta is a free messaging and calling app used by over 2 billion people across 180+ countries. It's super simple, reliable and private, making it perfect for staying in touch with your friends and family worldwide. WhatsApp works across mobile, tablet, and desktop even on slow connections, with no subscription fees*.\n\nPrivate messaging and calls across the world\n\nYour privacy is our priority. With end-to-end encryption, you can be sure that your personal messages and calls stay between you and who you send them to. And no one, not even WhatsApp, can read or listen to them.\n\nSimple and secure connections, right away\n\nAll you need is your phone number - no usernames or logins needed. Easily view your contacts on WhatsApp and start messaging. And what's more, you can easily  link your other devices, including iPads, for seamless connectivity.\n\nHigh quality voice and video calls\n\nEnjoy free, secure video and voice calls with up to 32 people for free. Your calls work across devices, even on slower connections, using your phone or tablet’s Internet service.\n\nGroup chats to keep you in contact\n\nStay close to friends and family through end-to-end encrypted group chats and calls. Share messages, photos, videos and documents across mobile, tablet, and desktop. You can also use call links and screen-sharing to make group calls and collaboration easy.\n\nStay connected in real time\n\nYou can share your location with those in your individual or group chats while using WhatsApp on your mobile phone. Or record a voice message for those moments when just text isn't good enough.\n\nShare daily moments through Status\n\nShare your everyday life with those who matter. With Status you can share text, photos, video, and GIF updates that disappear after 24 hours. You're always in control of who sees your status. Just choose who you want to share it with - all your contacts or selected ones. And bring your everyday to life.\n\n*Data charges may apply. Contact your provider for details.\n\n\n---------------------------------------------------------------------------\n\nIf you have any feedback or questions, please go to WhatsApp > Settings > Help > Contact Us\n\nTerms of Service: https://www.whatsapp.com/legal/terms-of-service \n\nLearn more about messaging privately: https://www.whatsapp.com/privacy \n\nLearn more about WhatsApp safety: https://www.whatsapp.com/security",
      "appUrl": "https://apps.apple.com/us/app/whatsapp-messenger/id310633997?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/10/0a/f4/100af45d-1537-1cdf-5417-646a936702ea/AppIcon-0-0-1x_U007epad-0-0-0-1-0-0-sRGB-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 544007664,
      "title": "YouTube",
      "developer": "Google",
      "rating": "4.68048",
      "ratingCount": 43896355,
      "price": "Free",
      "category": "Photo & Video",
      "description": "Get the official YouTube app on iPhones and iPads. See what the world is watching -- from the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more. Subscribe to channels you love, create content of your own, share with friends, and watch on any device.\n\nWatch and subscribe\n● Browse personal recommendations on Home\n● See the latest from your favorite channels in Subscriptions\n● Look up videos you’ve watched, liked, and saved for later in Library\n\nExplore different topics, what’s popular, and on the rise (available in select countries)\n● Stay up to date on what’s popular in music, gaming, beauty, news, learning and more\n● See what’s trending on YouTube and around the world on Explore\n● Learn about the coolest Creators, Gamers, and Artists on the Rise (available in select countries)\n\nConnect with the YouTube community\n● Keep up with your favorites creators with Posts, Stories, Premieres, and Live streams\n● Join the conversation with comments and interact with creators and other community members\n\nCreate content from your mobile device\n● Create or upload your own videos directly in the app\n● Engage with your audience in real time with live streaming right from the app\n\nFind the experience that fits you and your family (available in select countries)\n● Every family has their own approach to online video. Learn about your options: the YouTube Kids app or a new parent supervised experience on YouTube at youtube.com/myfamily\n\nSupport creators you love with channel memberships (available in select countries)\n● Join channels that offer paid monthly memberships and support their work\n● Get access to exclusive perks from the channel & become part of their members community\n● Stand out in comments and live chats with a loyalty badge next to your username\n\nUpgrade to YouTube Premium (available in select countries)\n● Watch videos uninterrupted by ads, while using other apps, or when the screen is locked\n● Save videos for when you really need them – like when you’re on a plane or commuting\n● Get access to YouTube Music Premium as part of your benefits\n\nNote: If you subscribe via Apple, payment will be charged to App Store Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed by going to Account Settings after purchase.\n\nYouTube paid service terms: https://www.youtube.com/t/terms_paidservice.\nPrivacy policy: https://www.google.com/policies/privacy",
      "appUrl": "https://apps.apple.com/us/app/youtube/id544007664?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/df/60/84/df608426-ce29-5777-56d1-42e386f0d47a/logo_youtube_2024_q4_color-0-1x_U007emarketing-0-0-0-7-0-0-0-85-220-0.png/100x100bb.jpg"
    },
    {
      "id": 835599320,
      "title": "TikTok - Videos, Shop & LIVE",
      "developer": "TikTok Ltd.",
      "rating": "4.73797",
      "ratingCount": 18165118,
      "price": "Free",
      "category": "Entertainment",
      "description": "TikTok is THE destination for mobile videos. On TikTok, short-form videos are exciting, spontaneous, and genuine. Whether you’re a sports fanatic, a pet enthusiast, or just looking for a laugh, there’s something for everyone on TikTok. All you have to do is watch, engage with what you like, skip what you don’t, and you’ll find an endless stream of short videos that feel personalized just for you. From your morning coffee to your afternoon errands, TikTok has the videos that are guaranteed to make your day.\n\nWe make it easy for you to discover and create your own original videos by providing easy-to-use tools to view and capture your daily moments. Take your videos to the next level with special effects, filters, music, and more. \n\n■ Watch endless amount of videos customized specifically for you\nA personalized video feed based on what you watch, like, and share. TikTok offers you real, interesting, and fun videos that will make your day.\n \n■ Explore videos, just one scroll away\nWatch all types of videos, from Comedy, Gaming, DIY, Food, Sports, Memes, and Pets, to Oddly Satisfying, ASMR, and everything in between.\n \n■ Pause recording multiple times in one video\nPause and resume your video with just a tap. Shoot as many times as you need.\n \n■ Be entertained and inspired by a global community of creators\nMillions of creators are on TikTok showcasing their incredible skills and everyday life. Let yourself be inspired.\n\n■ Add your favorite music or sound to your videos for free\nEasily edit your videos with millions of free music clips and sounds. We curate music and sound playlists for you with the hottest tracks in every genre, including Hip Hop, Edm, Pop, Rock, Rap, and Country, and the most viral original sounds.\n\n■ Express yourself with creative effects\nUnlock tons of filters, effects, and AR objects to take your videos to the next level.\n\n■ Edit your own videos \nOur integrated editing tools allow you to easily trim, cut, merge and duplicate video clips without leaving the app.\n\n■ Discover and Shop with TikTok Shop\nExplore trending products, exclusive deals, and seamless shopping experiences inspired by creators and brands you love—all in one place. Shop right from shoptab, videos or LIVEs without leaving the app, track your orders with ease, and enjoy a safe, secure shopping and transaction process.\n\n■ Obtain access to LIVE benefits to better interact with hosts!\nChoose from one-month subscription or auto-renewal subscription to enjoy special LIVE benefits (currently only available in limited regions)\n\nNote: \nIf you subscribe via Apple, payment will be charged to App Store Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Account will be charged for renewal within 24 hours prior to the end of the current period at the rate of the selected plan. Subscriptions and auto-renewal may be managed by going to Account Settings after purchase.\n\nTerms of Service —\nhttps://www.tiktok.com/legal/terms-of-service\n\nPrivacy Policy —\nhttps://www.tiktok.com/legal/privacy-policy\n\n* Any feedback? Contact us at https://www.tiktok.com/legal/report/feedback or tweet us @tiktok_us",
      "appUrl": "https://apps.apple.com/us/app/tiktok-videos-shop-live/id835599320?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/75/4a/b6/754ab6e4-98cc-4cd4-f535-2d4d71df8f7d/AppIcon_TikTok-0-0-1x_U007epad-0-1-0-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 324684580,
      "title": "Spotify: Music and Podcasts",
      "developer": "Spotify",
      "rating": "4.78773",
      "ratingCount": 37147536,
      "price": "Free",
      "category": "Music",
      "description": "With the Spotify app, you can explore an extensive library of music and podcasts for free. Curate the best playlists and stream millions of free songs, albums, and original podcasts on your phone or tablet. Subscribe to Spotify Premium to download and listen offline wherever you are, and unlock our catalog of audiobooks.\n\nWhy choose Spotify as your go-to music and podcast app? Here, you can:\n• Listen to over 100 million songs and 6 million podcast titles\n• Explore our selection of specially-crafted artist playlists\n• Easily search for your favorite songs, albums, artists, and podcasts\n• Discover personalized music recommendations tailored to your unique taste\n• Subscribe to your favorite free podcasts so you never miss an episode, and even curate your own podcast library\n\nSpotify Free is more than a music player - find the sounds you love and stream music and podcasts online, for free. Enjoy personalized playlists or curate and share your own, discover the hottest new releases, explore upcoming events from your favorites, and more.\n\n• Stream millions of free songs and podcasts\n• Create playlists with your favorite music\n• Share songs and playlists with friends and family (feature restrictions may apply in some regions)\n• Discover personalized playlists made just for you, and collaborate on playlists with your friends\n• Enjoy your personal Discover Weekly playlist every week\n• Stay in the know with the Release Radar and New Music Friday playlists\n• Find nearby events and gigs by your favorite artists\n• See your most played songs, genres, artists, and more with yearly Spotify Wrapped\n• Stream music across your devices with Spotify\n• Use Spotify Connect and enjoy listening on smart speakers, desktop, laptop, smart TV, Chromecast, PlayStation®, Xbox®, smartwatch, in your car, and more - limited number of device models apply\n\nSpotify Premium - a great way to enjoy the benefits of an offline music player, and stream music without WiFi. By pressing download, you can access your songs, playlists, podcasts, and audiobooks offline, wherever you are.\n• Listen to music, podcasts, and audiobooks - all in one place\n• Ad-free music listening: enjoy your music with no ad interruptions\n• Enjoy full on-demand playback\n• Audiobooks in Premium are currently available in the US, UK, Australia, Ireland, New Zealand, and Canada. Discover 250,000+ audiobook titles with 15 hours/month of available listening for Premium Individual subscribers and Duo & Family plan managers.\n• Superior sound quality on supported devices\n• AI DJ: a personalized guide that knows your music taste so well it can choose what to play for you\n• Enjoy on desktop, phone, tablet, computer, smartwatch, and in your car\n• Listen and control the listening session together by hosting a Jam in real time with friends\n• Download songs, podcasts, and audiobooks for offline listening, without an internet connection\n• No contract required - cancel your subscription whenever you want\n\nSpotify lets you play music wherever you are. Listen to your favorite songs and discover new music, podcasts, and audiobooks with the Spotify app!\n\nLOVE SPOTIFY?\nFollow us on Instagram: https://www.instagram.com/spotify\nFollow us on TikTok: https://www.tiktok.com/@spotify",
      "appUrl": "https://apps.apple.com/us/app/spotify-music-and-podcasts/id324684580?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/30/a8/c3/30a8c3fe-71c5-6646-529a-9bb8edc2b543/AppIcon-0-0-1x_U007emarketing-0-7-0-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 284882215,
      "title": "Facebook",
      "developer": "Meta Platforms, Inc.",
      "rating": "4.50666",
      "ratingCount": 22689101,
      "price": "Free",
      "category": "Social Networking",
      "description": "Where real people propel your curiosity. Whether you’re thrifting gear, showing reels to that group who gets it, or sharing laughs over fun images reimagined by AI, Facebook helps you make things happen like no other social network.\n\nExplore and expand your interests: \n* Shop Marketplace for hidden gems and take your hobbies to the next level\n* Personalize your Feed to see more of what you like, less of what you don’t\n* Ask Meta AI for information and get answers instantly\n* Drive into reels that reflect the things you're interested in\n* Search Facebook on any topic and get more interactive results\n\nConnect with people and communities:\n* Join groups to learn tips from real people who’ve been there, done that\n* Get inspired by creators, or catch up with Friends\n* Add new Friends to your world, but also decide how closely to keep up with them\n* Privately message relatable posts that only your BFF will get or that reels trend everyone’s talking about\n\nShare your world:\n* Use generative AI to create custom stickers and images to delight friends\n* Customize your profile to choose how you show up and who sees your posts\n* Effortlessly create reels from trending templates, or showcase your creativity with a full suite of editing tools\n* Capture moments on the fly with stories\n\nSome features may not be available in your country or region. \n\nTerms & Policies: https://www.facebook.com/policies_center\nPrivacy Policy: https://www.facebook.com/privacy\n\nLearn how we're working to help keep our communities safe across Meta technologies at the Meta Safety Center: https://about.meta.com/actions/safety",
      "appUrl": "https://apps.apple.com/us/app/facebook/id284882215?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/78/ff/c0/78ffc0c9-8baa-2908-da5a-0bf06065e3b6/Icon-Production-0-0-1x_U007epad-0-1-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 333903271,
      "title": "X",
      "developer": "X Corp.",
      "rating": "4.5908",
      "ratingCount": 10139849,
      "price": "Free",
      "category": "News",
      "description": "Welcome to X (formerly known as Twitter), your trusted digital town square where conversations unfold in real time, and the world connects through breaking news, live events, podcasts, and everything in between.\n\nWhether you're passionate about sports, tech, music, or politics, X is your front-row seat to what’s happening across the globe.\n\nX isn’t just another social media app, it’s the ultimate destination for staying well informed, sharing ideas, and building communities. With X, you’re always in the loop with relevant trending topics and breaking news, delivered instantly to your screen, raw and unfiltered.\n\nWhat You Can Do on X:\n• Follow breaking news from around the world before it hits the headlines, and stay ahead of the curve with real-time updates on trending topics and viral conversations.\n\n• Post your thoughts, photos, and videos with a global community. Join millions of users in shaping public dialogue across social, cultural, and political conversations.\n\n• Discover Grok, the AI assistant powered by X’s real-time data. You can ask Grok to summarize trending news, explain videos, or give you more context about posts.\n\n• Stream live video or go live with Spaces, our audio feature that enables you to host discussions, hold interviews, or start your next live podcast. Whether you're streaming a concert, a live game, or your thoughts on a hot topic, X keeps your audience engaged.\n\n• Watch videos: from live breaking news and sports clips to podcasts and gaming sessions that last up to 3 hours long. Many of the world’s leading voices, in comedy, gaming, podcasting, and politics, all share their content on X.\n\n• Connect and chat privately with friends, followers, customers, or collaborators through Direct Messages.\n\n• Join and build communities tailored to your interests: from sports news, gaming, entertainment, crypto, entrepreneurship, tech, and more.\n\n• Subscribe to X Premium to unlock exclusive features like a blue checkmark, boosted visibility, prioritized replies, fewer ads, longer videos, and post editing. X Premium also gives you access to creator revenue sharing and the ability to offer exclusive content to subscribers.\n\nWhy X?\nIn a world of constant change, X is your real-time source to stay ahead of the curve, connect with people, and explore diverse perspectives. From breaking live news and trending memes to top podcasts and live streams from your favorite creators, X brings it all together in one powerful social experience.\n\nPrivacy Policy: https://x.com/privacy\nTerms and Conditions: https://x.com/tos",
      "appUrl": "https://apps.apple.com/us/app/x/id333903271?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/c9/96/29/c99629bb-9bf0-9755-7c05-c3e551f8e0bf/ProductionAppIcon-0-0-1x_U007emarketing-0-8-0-0-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 284417350,
      "title": "iTunes Remote",
      "developer": "Apple",
      "rating": "4.61137",
      "ratingCount": 38589,
      "price": "Free",
      "category": "Entertainment",
      "description": "iTunes Remote is the best way to control Apple Music, iTunes, or the Apple TV app from anywhere in your home. Simply download the app to your iPhone or iPad, and connect directly to Apple Music, iTunes, or the Apple TV app on your Mac or PC.\n\nWith iTunes Remote you can:\n\t•\tAccess your Apple Music, Apple TV, or iTunes libraries\n\t•\tBrowse music by artist, albums, and songs\n\t•\tBrowse movies, TV shows, and podcasts\n\t•\tCreate and edit playlists\n\t•\tSee upcoming songs with Up Next\n\t•\tSearch your entire Apple Music, Apple TV, or iTunes libraries\n\t•\tExplore shared Apple Music, Apple TV, or iTunes libraries\n\t•\tListen with AirPlay\n\t•\tSend music to AirPlay speakers\n\t•\tGroup speakers together to play music in multiple rooms at the same time\n\t•\tSet the volume on each speaker independently\n\nRequirements:\n\t•\tiPhone, iPad, or iPod touch with iOS 11.4 or later\n\t•\tWi-Fi connection to Apple TV, Apple Music, or iTunes on a Mac or PC\n\t•\tmacOS 10.15.2 or higher for Apple Music and the Apple TV app\n\t•\tiTunes 12.8 or later is recommended for use with iTunes Remote",
      "appUrl": "https://apps.apple.com/us/app/itunes-remote/id284417350?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple124/v4/5c/a3/e3/5ca3e3fa-ac7a-ef92-5640-595985705287/AppIcon-0-0-1x_U007emarketing-0-0-0-6-0-0-sRGB-0-0-0-GLES2_U002c0-512MB-85-220-0-0.png/100x100bb.jpg"
    },
    {
      "id": 310633997,
      "title": "WhatsApp Messenger",
      "developer": "WhatsApp Inc.",
      "rating": "4.69194",
      "ratingCount": 16565819,
      "price": "Free",
      "category": "Social Networking",
      "description": "WhatsApp from Meta is a free messaging and calling app used by over 2 billion people across 180+ countries. It's super simple, reliable and private, making it perfect for staying in touch with your friends and family worldwide. WhatsApp works across mobile, tablet, and desktop even on slow connections, with no subscription fees*.\n\nPrivate messaging and calls across the world\n\nYour privacy is our priority. With end-to-end encryption, you can be sure that your personal messages and calls stay between you and who you send them to. And no one, not even WhatsApp, can read or listen to them.\n\nSimple and secure connections, right away\n\nAll you need is your phone number - no usernames or logins needed. Easily view your contacts on WhatsApp and start messaging. And what's more, you can easily  link your other devices, including iPads, for seamless connectivity.\n\nHigh quality voice and video calls\n\nEnjoy free, secure video and voice calls with up to 32 people for free. Your calls work across devices, even on slower connections, using your phone or tablet’s Internet service.\n\nGroup chats to keep you in contact\n\nStay close to friends and family through end-to-end encrypted group chats and calls. Share messages, photos, videos and documents across mobile, tablet, and desktop. You can also use call links and screen-sharing to make group calls and collaboration easy.\n\nStay connected in real time\n\nYou can share your location with those in your individual or group chats while using WhatsApp on your mobile phone. Or record a voice message for those moments when just text isn't good enough.\n\nShare daily moments through Status\n\nShare your everyday life with those who matter. With Status you can share text, photos, video, and GIF updates that disappear after 24 hours. You're always in control of who sees your status. Just choose who you want to share it with - all your contacts or selected ones. And bring your everyday to life.\n\n*Data charges may apply. Contact your provider for details.\n\n\n---------------------------------------------------------------------------\n\nIf you have any feedback or questions, please go to WhatsApp > Settings > Help > Contact Us\n\nTerms of Service: https://www.whatsapp.com/legal/terms-of-service \n\nLearn more about messaging privately: https://www.whatsapp.com/privacy \n\nLearn more about WhatsApp safety: https://www.whatsapp.com/security",
      "appUrl": "https://apps.apple.com/us/app/whatsapp-messenger/id310633997?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/10/0a/f4/100af45d-1537-1cdf-5417-646a936702ea/AppIcon-0-0-1x_U007epad-0-0-0-1-0-0-sRGB-0-85-220.png/100x100bb.jpg"
    },
    {
      "id": 389801252,
      "title": "Instagram",
      "developer": "Instagram, Inc.",
      "rating": "4.69105",
      "ratingCount": 28204600,
      "price": "Free",
      "category": "Photo & Video",
      "description": "Little moments lead to big friendships. Share yours on Instagram. \n— From Meta\n\nConnect with friends, find other fans, and see what people around you are up to and into. Explore your interests and post what's going on, from your daily moments to life's highlights.\n\nShare what you’re up to and into:\n- Turn your life into a movie and discover short, entertaining videos on Instagram with Reels.\n- Keep up with friends on the fly with Stories and Notes that disappear after 24 hours.\n- Start group chats and share unfiltered moments with your Close Friends.\n- Share memories from recent events or trips in Feed.\n- Customize your posts with exclusive templates, music, stickers and filters.\n\nDive into your interests.\n- Watch videos from your favorite creators and discover new content that’s personalized to your interests.\n- Get inspired by photos and videos from new accounts in Explore.\n- Discover brands and small businesses, and shop products that are relevant to your personal style.\n\nSome Instagram features may not be available in your country or region.\n\nTerms and Policies: https://help.instagram.com/581066165581870\n\nConsumer Health Privacy Policy: https://privacycenter.instagram.com/policies/health\n\nLearn how we're working to help keep our communities safe across Meta technologies at the Instagram Safety Center: https://about.instagram.com/safety",
      "appUrl": "https://apps.apple.com/us/app/instagram/id389801252?uo=4",
      "iconUrl": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/7f/df/7c/7fdf7c64-d78d-33ca-707f-e2147e91e498/Prod-0-0-1x_U007epad-0-1-0-sRGB-85-220.png/100x100bb.jpg"
    }
  ],
  "reviews": [
    {
      "author": "Mrhiej",
      "rating": "1",
      "title": "Unfairly banning users",
      "content": "Currently there is a large class action lawsuit and over 40k on a petition. People are getting falsely banned for horrible accusations!",
      "date": "2025-10-02T20:15:17-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "WUNTER..68$39",
      "rating": "1",
      "title": "🤦🏽‍♀️",
      "content": "This app needs to be fixed it is worried about the wrong things, and people they're suspending/deleting the wrong peoples accounts, they are focused on how many times a person you follow has changed their username,and marks them as a potential scam, and when you ignpre it too many times they will eventually suspend/delete your account, and appealing it doesn't get your account back, and after it suspends one of your accounts and you try to make another with the same number it suspends that one too, everyone please don't download this app.",
      "date": "2025-10-02T20:13:17-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Stop banning m3",
      "rating": "1",
      "title": "Instagram",
      "content": "They have suspended my account for no reason and I can't get it back",
      "date": "2025-10-02T20:08:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "gavlanierf05",
      "rating": "1",
      "title": "Incredibly buggy",
      "content": "I was wrongfully permanently banned. After looking online, it appears that this is a huge issue affecting other people as well. Instagram has taken no steps to correct this issue.",
      "date": "2025-10-02T20:06:10-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Imperial nate",
      "rating": "1",
      "title": "Why is my account compromised?",
      "content": "I can’t use this app anymore because my account got compromised for what \nplease fix this",
      "date": "2025-10-02T20:04:28-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "javierrres123",
      "rating": "1",
      "title": "It keeps restricting my account for no reason",
      "content": "I didn’t do nothing wrong I just use it to text ppl or see vids and I keep getting my account restricted for no reason I just got a new phone nd new number and i was making an account and once’s I made it and automatically restricted its annoying that it keeps doing that for no reason.",
      "date": "2025-10-02T20:02:09-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Smhinsta",
      "rating": "1",
      "title": "Delete the repost",
      "content": "Why am I accidentally clicking repost? Because you decided to put repost on where people scroll. Move it or delete it",
      "date": "2025-10-02T19:54:34-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "TETE_33",
      "rating": "5",
      "title": "Getting banned/suspended for no reason",
      "content": "I had sent my friend a reel like I usually do. My friend wasn’t able to see the video it had said “unavailable” there was nothing wrong with the reel i had sent her. It was just a funny relatable reel. When i tired sending it to her again it had said my account was being suspended. I didn’t understand because haven’t done anything wrong. Then it had asked me to take a video of myself to confirm its a real person. I had created another acc did the something. This is just very unexpected able. INSTAGRAM needs to FIXS this issue and STOP banning/ suspending peoples accounts for no REASON!.",
      "date": "2025-10-02T19:54:28-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "MRLWS1",
      "rating": "5",
      "title": "Great App",
      "content": "Instagram is a great app!",
      "date": "2025-10-02T19:54:19-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Deneiyah",
      "rating": "5",
      "title": "Posting",
      "content": "Thanks for the great activitys and things we can do on instagram but may please add a little more things thank you 🙂",
      "date": "2025-10-02T19:48:03-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "gillianjewelle03",
      "rating": "3",
      "title": "Invite collaborators",
      "content": "If I invite a collaborator to a post, once they accept, they should have the option to repost it/share it to their facebook. Especially on and between business accounts. You can have an approval question asking the original poster if the collaborator can share to other socials like threads and facebook!!",
      "date": "2025-10-02T19:41:01-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Ai_liltop",
      "rating": "5",
      "title": "My login",
      "content": "So I tried logging in my account and even tried facebook my username is ai_lostsoul21 and every time I tried to change change the password to get it back it will say password incorrect like if I was trying to login in so I restarted the app a couple times and turned off my phone and it’s just the same thing over and over if there’s anyway y’all can help me login that will be great and I love the app (don’t tell TikTok but it’s better than it) thank you",
      "date": "2025-10-02T19:40:35-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Yiyi 1995",
      "rating": "5",
      "title": "Me encanta instagram",
      "content": "Genial",
      "date": "2025-10-02T19:29:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "INCREDIBLE TECH!",
      "rating": "5",
      "title": "Classy and fun all at the same time!!",
      "content": "I am not a gamer but I am after playing at Ava’s wine bar! A lot of fun and money!",
      "date": "2025-10-02T19:28:02-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Darius926",
      "rating": "1",
      "title": "Darius Moreno",
      "content": "Instagram is stupid. Don't know why I got banned.",
      "date": "2025-10-02T19:28:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Bluestudio3783",
      "rating": "5",
      "title": "Love sharing my lifestyle! Thank you!!",
      "content": "Easiest way to share my lifestyle!",
      "date": "2025-10-02T19:24:37-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "raaachelmaine",
      "rating": "1",
      "title": "ENOUGH WITH THE ADS",
      "content": "Why are there 50000 ads in between every single story???!!!!!! ENOUGH",
      "date": "2025-10-02T19:21:31-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Eazye balla",
      "rating": "3",
      "title": "Do better",
      "content": "They took my account down for no reason at all and I couldn’t even get it back they justi taking people accounts to be honest if we can’t get our accounts we might as well go back to Snapchat y’all they playing around I made over 7 accounts some I can’t log in some get deleted and I don’t anything TikTok is better than instagram now",
      "date": "2025-10-02T19:13:01-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "choey545",
      "rating": "4",
      "title": "Evil, on purpose",
      "content": "Waste, fraud, and abuse!!!\nAnyone offering Medicare insurance knows this line!!!\nWaste is when you cut benefits for those less fortunate than you and build a 200million dollar ball room next to the White House!!!\nFraud is when you do something that will benefit you and probably only you, you know it’s wrong, but you do it anyway!!!\nAbuse is when you absolutely ruin someone, or a bunch of someones, just because you can!!! “Because you’re rich, they let you”!!! But you notice, in every scenario, someone suffers! What is it with you Repuglicans! Why do you need someone to suffer for you to do well!!! I’ll leave you with this!\nYour anger and hatred is directed at the wrong people! \nI don’t have your money! But I Know who does!!! And they need a reason to pass it around!!!\nDon’t wait for the government!\nYou can do it!!! Have a contest!\nSee who can help the neediest people in America and change their lives!! Wal-mart, you start!!!\nTake2% of your gross last year and pass it back to your employees! The employee working for you who makes the least gets the largest bonus and it lessens as it goes up the organization til the CEO gets one penny! Taxing it!!!\nFor the company, complete deduction!!! For the people, taxed at 2%! Watch this economy take off!!! And keep doing it!! Share your business with your employees!!! It will pay off in more ways than you know!!! And one more thing!\nNo more!\nWASTE,FRAUD,and ABUSE!!!",
      "date": "2025-10-02T18:58:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Angie win .",
      "rating": "3",
      "title": "insta suspension .",
      "content": "i had insta for like a few years since i was 13 , and im 19 now . & my account got suspended and disabled , and i been trying to make new accounts after new ones & it still gets me a warning as suspension . i make a new acc and change a new email or gmail still doesn’t work . & it happens to most people not just only me . other than that please fix my ACCOUNT .. Instagram or META AI . thanks !",
      "date": "2025-10-02T18:56:06-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "ironsipder7",
      "rating": "5",
      "title": "I like reels",
      "content": "I love to doomscroll and see femboys on my feed 24/7, keep up the good work femboy posters",
      "date": "2025-10-02T18:48:37-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "geoluv",
      "rating": "1",
      "title": "Only want you to watch reels so they can blast you with ads",
      "content": "You can no longer tap a commenter’s name to go to their page to check out their wall posts.  You tap their name and nothing happens, all you can do is tap their avatar which takes you to their stories.  Instagram is doing this because every second you spend on scrolling stories/reels or scrolling your feed lets them blast you with ads and every second you spend checking out other users accounts and looking at wall posts is lost ad revenue for meta.  The whole point of “social media” is to make social connection with other people.  Meta is destroying the social connectivity aspect of Instagram in order to keep you doomscrolling so they can blast ads at you.  This is a very up front and obvious example of how tech companies are actually devolving social media into a perverse profit-above-all-else social experiment.",
      "date": "2025-10-02T18:29:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "emoni r",
      "rating": "3",
      "title": "..",
      "content": "im ngl , yal b suspending peole for no reason onnis app but hey , its a coo app",
      "date": "2025-10-02T18:22:52-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Briaaa💞",
      "rating": "1",
      "title": "Logging into my account",
      "content": "I keep trying to log into my account, but when I try to log into my account, it goes to another screen and it says “ enter password” but when I enter my password, it says that it is wrong. I emailed you guys and I am waiting for you guys to email me back. Please fix this. I’ve been trying to do this since yesterday. I am tired. This is the only app I can communicate people on, and I cannot log into my account changed the password multiple times and I cannot log please respond to this and help me login to my account. Please and thank you.",
      "date": "2025-10-02T18:12:18-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Prettyface_.diamond_",
      "rating": "1",
      "title": ".",
      "content": "They keep banning my account for nothing so you should not get this app if u want that",
      "date": "2025-10-02T18:00:58-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Flyfisherz3",
      "rating": "1",
      "title": "EASY TO HACK",
      "content": "no way to stop hackers",
      "date": "2025-10-02T17:59:27-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Chichi6678",
      "rating": "1",
      "title": "Can’t scroll down my feed",
      "content": "Ever since the new iPhone update I get the “try again” error message when trying to scroll down my feed",
      "date": "2025-10-02T17:53:55-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Asianotas1an",
      "rating": "1",
      "title": "Why",
      "content": "I woke up to my account suspended saying i was violating the terms n i didn’t do nothing not only did my account with all my friends get deleted my other 2 accounts too its ridiculous cuz i got multiple people who account suspended for false accusations yall need to fix yall app this is beyond ridiculous i have memories on that account please give my account back thank you",
      "date": "2025-10-02T17:52:26-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Youraweridoinstagram",
      "rating": "1",
      "title": "Ban FOR NO REASON",
      "content": "I hate how you banned me for no reason just give me my acc back lil bro PLEASe 🙎🏻‍♀️🙏🏻",
      "date": "2025-10-02T17:40:12-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "JayJay__Lol",
      "rating": "5",
      "title": "Uhhh it’s okay",
      "content": "The app itself is okay the community toxic asl boom done",
      "date": "2025-10-02T17:38:44-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "-----help---------------",
      "rating": "1",
      "title": "iPad update: Auto scrolling stories is ANNOYING",
      "content": "This iPad update is TERRIBLE.\nPlease. Fix it. I can’t stay on a persons stories without going to their account. Stories are the only part of instagram that I use. This new layout is lame as well. The most “anti-user friendly” update ever.",
      "date": "2025-10-02T17:34:13-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Lolollilkikanab",
      "rating": "1",
      "title": "Dumb app",
      "content": "If you sign out you can’t sign in anymore it doesn’t even send a code to your phone number terrible service",
      "date": "2025-10-02T17:23:42-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Ale LLNM",
      "rating": "5",
      "title": "Good for business",
      "content": "Great for business ❤️❤️❤️",
      "date": "2025-10-02T17:18:44-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "kevin chuk",
      "rating": "1",
      "title": "Second TikTok",
      "content": "With the latests update the home tab is now nothing but reels and time wasters. I really wish I could control what I see and for there to be a dedicated ‘only pictures’ tab.",
      "date": "2025-10-02T17:15:58-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "I466ff4",
      "rating": "1",
      "title": "Wrongly disabled",
      "content": "I’m very disappointed with Instagram right now. My accounts (@indirahh._ and @yesitsdirah) were wrongfully banned even though I didn’t break any guidelines. I had these accounts for months with no issues, and then they were suddenly taken down. I’ve tried appealing but haven’t gotten any real help or explanation. It feels unfair because I see many other users with similar usernames and content who are not banned. Instagram should review bans more carefully and actually listen when people say they were suspended by mistake.",
      "date": "2025-10-02T16:50:59-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "iSpect8_",
      "rating": "2",
      "title": "I can’t go LIVE on Instagram",
      "content": "Please update to go to LIVE again on IG again please",
      "date": "2025-10-02T16:48:15-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "grace_t26",
      "rating": "1",
      "title": "banned for no reason",
      "content": "kindly reinstate my account. i have had it for 6 years. if not, please provide the exact reason and piece of media for which i was banned.\n\ni will fix the review once my account is back.",
      "date": "2025-10-02T16:45:57-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Stephen Githara",
      "rating": "1",
      "title": "Meta will ban you for no reason and has no support whatsoever",
      "content": "I have used Instagram for almost 10 years now and this past Saturday I was wrongly banned for CSE by Meta’s faulty AI system. Immediately emailed Meta and get no response. As of the time I’m writing this, a human being has not reviewed my account yet and I’ve exhausted all avenues of communication with Meta. I’ve even purchased Meta Verified to speak to Meta Support and still no one has reviewed my account to see I’ve done nothing wrong. This isn’t just happening to me, but thousands of accounts. Don’t get this app unless you want to get banned for no reason whatsoever.",
      "date": "2025-10-02T16:40:02-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "twglolulu",
      "rating": "1",
      "title": "Friends",
      "content": "I don’t like that instagram limit things of what I can see, like someone’s followers or following list that not very protect their community fix  that please and thank you",
      "date": "2025-10-02T16:32:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "tootltttes",
      "rating": "1",
      "title": "Account banned for no reason",
      "content": "Accounts are getting banned with no way to access support. Just Terrible",
      "date": "2025-10-02T16:30:11-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Aramesh rezvan80",
      "rating": "5",
      "title": "Aramesh",
      "content": "Rezvan80",
      "date": "2025-10-02T16:29:34-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Dumbassapp05",
      "rating": "1",
      "title": "Banned",
      "content": "Ya’ll wrong accused dnd banned people",
      "date": "2025-10-02T16:26:10-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "R - Meta",
      "rating": "1",
      "title": "Account wrongfully suspended",
      "content": "Instagram account suspended with zero evidence of any wrong doing. There is no way to refute any claims made. Please fix this issue.",
      "date": "2025-10-02T16:21:29-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "SSSChen",
      "rating": "1",
      "title": "Main page",
      "content": "Could you please have an option to make the pictures square again on the main page?",
      "date": "2025-10-02T16:19:45-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "vamshii26",
      "rating": "1",
      "title": "Suspended for no reason",
      "content": "Suspended for no reason",
      "date": "2025-10-02T16:11:36-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Seily Perez",
      "rating": "1",
      "title": "Account taking",
      "content": "YOU KEEP TAKING MY ACCOUNTS FOR NO REASON . And I can’t even keep an account for 3 minutes without you suspending it .",
      "date": "2025-10-02T16:05:54-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "aidan morin",
      "rating": "5",
      "title": "aidan",
      "content": "it keeps on suspended all my accounts for no reason",
      "date": "2025-10-02T15:47:38-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "hurrem16483",
      "rating": "5",
      "title": "топ",
      "content": "сейчас вообще все стало круче чем раньше!! огромное спасибо за то что фотки сейчас не обрезаются если их много, и алгоритмы в рилсах супер короче пупсики возвращайтесь в россию матушку💋🙏",
      "date": "2025-10-02T15:42:14-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Daily.Homegrown",
      "rating": "3",
      "title": "Insta",
      "content": "Would be better if they didn’t limit the canna community and flag profiles limiting social interaction with peers",
      "date": "2025-10-02T15:34:09-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Dedgee",
      "rating": "4",
      "title": "WhatsApp",
      "content": "Messenger",
      "date": "2025-10-02T20:11:38-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "M. Dev.",
      "rating": "5",
      "title": "Easy and Convenient",
      "content": "Especially for international or wify calling. I’d like to hear more about the privacy features constantly advertised making this app secure. In a digital age this is no different from what you might be using for a smartphone.",
      "date": "2025-10-02T19:44:34-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "AColchamiro",
      "rating": "5",
      "title": "Perfect",
      "content": "I’ve been using ‎WhatsApp for years and it is just amazing",
      "date": "2025-10-02T19:40:00-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Jajaja 😹 que 😨",
      "rating": "5",
      "title": "Muy bueno",
      "content": "👍👍👍👍👍👍",
      "date": "2025-10-02T19:25:26-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Irisyei",
      "rating": "5",
      "title": "Wathsapp",
      "content": "Ayuda por favor 📣📣 no puedo acceder a los stickers destacados o favoritos , ya he hecho de todo hasta borré la app y la volví a instalar he entrado en configuración y he verificado todo pero es imposible acceder , cuando tocó el icono de los destacados la pantalla se frisa y tengo que cerrar la app y volverla a abrir para poder usarla , ayúdenme por fabor",
      "date": "2025-10-02T19:12:15-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chicken949",
      "rating": "1",
      "title": "No sirve",
      "content": "No deja salir de la conversación cuando uno está en una llamada es una actualización tan estupida!",
      "date": "2025-10-02T18:39:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Ricch LIFFE12",
      "rating": "1",
      "title": "Problem we are  facing",
      "content": "Now WhatsApp is no more WhatsApp when you post a pic you’ve taken or a video , it then turns to be blur , you doesn’t get the original one . Kindly work on it . Thank you",
      "date": "2025-10-02T18:25:48-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Fractional/2",
      "rating": "1",
      "title": "Frustrated",
      "content": "There is nothing more frustrating than trying to transfer chats from Android to iPhone. If you don’t want to do it when you set up the phone you have 0 means to transfer them later unless you want to pay yearly subscription for a third party app that you’re going to use only once. It’s 2025, it’s easier and faster and cheaper if not free to generate unbelievable AI videos that to be able to merely continue an WhatsApp conversation where you left it earlier.",
      "date": "2025-10-02T18:16:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Kyle.Kelly589",
      "rating": "5",
      "title": "Wow",
      "content": "Cool",
      "date": "2025-10-02T16:53:45-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Illupo1979",
      "rating": "1",
      "title": "Una basura la nueva actualización",
      "content": "La Nueva actualización una ando en moto y cualquier vibracion activa un mensaje de error y se cortan las notas de viz",
      "date": "2025-10-02T16:26:52-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Fafafafafafafafafafaf",
      "rating": "1",
      "title": "it  is  so. BAD",
      "content": "I got expose like actually",
      "date": "2025-10-02T15:39:12-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Juansebz",
      "rating": "1",
      "title": "Lost my chats conversations",
      "content": "Horrible service for not being able to recover my chats conversations.",
      "date": "2025-10-02T15:36:12-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Boris James Fischer",
      "rating": "5",
      "title": "Good company",
      "content": "They are very reliable, knowledgeable, and patient.",
      "date": "2025-10-02T15:00:21-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Bel Fanm Creole",
      "rating": "2",
      "title": "Rate",
      "content": "My previous message would not back up to my new phone",
      "date": "2025-10-02T14:44:03-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chuchu1373",
      "rating": "5",
      "title": "Esta última actualización estoy teniendo problemas con mí whuasat",
      "content": "No me funciona bien whuasat",
      "date": "2025-10-02T14:44:02-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "אדל קקון",
      "rating": "5",
      "title": "שלום",
      "content": "אפליקציה טובה",
      "date": "2025-10-02T13:18:11-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Yetunde111",
      "rating": "1",
      "title": "URGENT: REQUEST FOR REVIEW AND RESTORATION OF BLOCKED ACCOUNT",
      "content": "Dear WhatsApp Support,\n\nI hope this message finds you well. I am writing to urgently request a review and restoration of my WhatsApp account [your phone number]. My account has been repeatedly blocked despite not engaging in any activity that violates WhatsApp’s policies.\n\nOver the past few days, my account was blocked multiple times, and each time I submitted a review, it was restored temporarily, only to be blocked again without any clear explanation. I am confident that I am not engaging in any spammy or policy-violating behavior.\n\nI kindly request a thorough review of my account activity. I rely on WhatsApp for business communication and personal connections, and I am committed to complying with all policies.\n\nPlease let me know if there is any additional information I can provide to resolve this issue promptly.\n\nThank you for your attention and assistance.",
      "date": "2025-10-02T12:52:13-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "JGEJMZ",
      "rating": "5",
      "title": "Finalmente puedo tener WhatsApp en mi iPad",
      "content": "Ya tenía muchos años esperando que tuvieran una aplicación para el iPad,  normalmente usaba el web pero ahora siento que es más fluido.",
      "date": "2025-10-02T11:47:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "nhs503",
      "rating": "4",
      "title": "great app but needs better iOS/Android migration",
      "content": "Countless Reddit threads people struggling to move from iOS to android or android to iOS. Multiple arcane phone resetting procedures later it still doesn’t work well. There should be a simple export and import to cloud for message history, and the application should be able to translate between formats.",
      "date": "2025-10-02T11:13:13-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Stmple",
      "rating": "5",
      "title": "Excelente aplicación",
      "content": "Lo más usado",
      "date": "2025-10-02T10:56:10-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "AxelMTF",
      "rating": "5",
      "title": "Hola",
      "content": "Solo quería preguntar algo mi  no actualiza a la versión 15.1 ya entonces no puedo utilizar WhastApp no entiendo eso porfavor",
      "date": "2025-10-02T10:53:31-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "𝐃𝐚 𝐤𝐢𝐳𝐚✞",
      "rating": "5",
      "title": "Kiza olifa",
      "content": "Kiza olifa",
      "date": "2025-10-02T10:16:57-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "asertivo del football",
      "rating": "4",
      "title": "Toyota Fortuner 2024",
      "content": "En existencia actualmente?\nCuantos kms",
      "date": "2025-10-02T09:38:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Amir wehbe",
      "rating": "5",
      "title": "Good",
      "content": "So so so good",
      "date": "2025-10-02T08:46:48-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "ĶÏÑĠ Perry bwoy",
      "rating": "1",
      "title": "T",
      "content": "Messages run slow",
      "date": "2025-10-02T08:35:33-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Barbiegirl2711",
      "rating": "3",
      "title": "Regular",
      "content": "La app me gusta pero estoy harta de que el desordene los estados no los puedo ver en orden es desquiciante el reguero que forman y odio más aún no poder seguir ningún canal porque si lo sigo me riega aún más la bandeja",
      "date": "2025-10-02T08:29:18-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "pandora 247",
      "rating": "1",
      "title": "35 scam calls a day from WhatsApp selling number",
      "content": "Update had to download to new phone went from 1 spam call a day to 50 with in the same day I downloaded and set up the app… scam app \n\nDon’t download. It’s free cause they sell you phone number. I get 35 spam calls a day. Never got any until I downloaded this junk app. I don’t even take my phone off mute anymore cause it’s non stop spam calls. Company should be shut down for causing harassment.",
      "date": "2025-10-02T08:23:08-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Bri9988",
      "rating": "5",
      "title": "B",
      "content": "I talk to my best friend now",
      "date": "2025-10-02T07:35:03-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Jeragomez",
      "rating": "1",
      "title": "Horrible",
      "content": "Cuando van arreglar la nueva actualización? Maoísmo se me sube la ventana de sticker hasta arriba y no se puede bajar solo cerrando la app. Los mensajes se suben solos en el chat, que horrible",
      "date": "2025-10-02T06:56:34-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chess0304",
      "rating": "1",
      "title": "Banned after first message ever lol",
      "content": "Installed for first time in my life via a business contact link to ask a question to a business.  Within 1 minute of sending my first and only message on this app in my life I was banned and having to appeal.  Too funny, I’ll go back to not using it I guess.",
      "date": "2025-10-02T06:18:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "hecrossi",
      "rating": "5",
      "title": "Genial",
      "content": "Las posibilidades de comunicarse a cualquier parte del mundo con esta calidad a cambiado profundamente a la sociedad humana. Y aunque algunos lo utilicen para hacer daño confío en que la gran mayoría lo utilicen para mejor la sociedad cosa que parece difícil a la luz de tantos conflictos. No aflojen en su determinación de mejorar la comunicación . Felicitaciones",
      "date": "2025-10-02T06:17:35-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Rommyraphael",
      "rating": "1",
      "title": "Banyak Bug",
      "content": "Semenjak update versi 25.25.73 banyak sekali bug, dan yang paling parah adalah :\n\n1. Proses searching sangat lambat.\n\n2. Kalau saya menggunakan tanda • untuk setiap paragraf dan menekan enter untuk pindah paragraf maka muncul 2 titik paragraf baru yang seharusnya di versi sebelumnya hanya keluar 1 titik paragraf baru.\n\nBug2 ini sangat mengganggu tolong secepatnya diperbaiki admin…🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
      "date": "2025-10-02T05:51:10-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "no tengo apodos soy maria",
      "rating": "5",
      "title": "Mis llamadas",
      "content": "Siempre me he comunicado muy bien , gracias a Ud",
      "date": "2025-10-02T04:27:47-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "APTomas",
      "rating": "4",
      "title": "Mala actualización",
      "content": "Ahora solo puedo subir videos de 38 segundos a mis Estados, antes era de 1:30 minutos! No entiendo por qué",
      "date": "2025-10-02T04:01:18-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "PaulZadeh",
      "rating": "5",
      "title": "WhatsApp Is not enough secure and agile",
      "content": "As a phD in AI, I do believe WhatsApp is not the best messaging app on the market and not secure at all. So fragile",
      "date": "2025-10-02T03:09:16-07:00",
      "version": "25.27.72",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "uhuegbu",
      "rating": "3",
      "title": "Schedule message",
      "content": "Just like you have created schedule calling, I think schedule messaging would be appreciated? Thank you so much",
      "date": "2025-10-02T02:30:57-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "giorgi.tsu",
      "rating": "1",
      "title": "Android and iOS incompatibility",
      "content": "The reason I am giving one star is that it’s a mess and huge pain to move chats and backups from android to iPhone and vice Versa. This is the reason I gave up using WhatsApp and moved to Telegram. When I wanted to move my backup from Google to IPhone there is no way to download backup from Google and then restore on iPhone. Also there is no way to sign in Google on IPhone either to restore WhatsApp backup from Google that was created from Android. similar isssue exists when you want to move from iPhone backup to Android WhatsApp. There is an app Move to iOS on Android but that works only on Factory Reset and then you cannot recover iPhone from iCloud. So basically when you are using WhatsApp you must be  either in iPhone or Android and for this reason I moved to Telegram.",
      "date": "2025-10-02T01:54:02-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "112494pd47",
      "rating": "5",
      "title": "Great app",
      "content": "Works great",
      "date": "2025-10-02T01:31:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Gatorade13579",
      "rating": "1",
      "title": "not receiving any notifications when my phone is off",
      "content": "i don’t receive text notifications unless my phone is on and unlocked. otherwise they go unnoticed. fix this you tech nerds asap",
      "date": "2025-10-01T22:09:19-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Santagto",
      "rating": "5",
      "title": "Sunrise in Santorini",
      "content": "Great",
      "date": "2025-10-01T21:27:29-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "sunilsardar07",
      "rating": "5",
      "title": "Sunil Sardar",
      "content": "Great communication tool for all generations. Thanks WhatsApp.",
      "date": "2025-10-01T21:06:06-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Emily niño",
      "rating": "5",
      "title": "Barbie Niño",
      "content": "Muy bueno en mi IPhone si trabaja :).. me encanta mucho es una aplicación muy buena.. 😘😘",
      "date": "2025-10-01T20:52:39-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "J - F - T - M",
      "rating": "5",
      "title": "Final para michuuu",
      "content": "Trizte final nosotros termina planeta mutituddd ze ba vuena termino Wasapthtpthhh",
      "date": "2025-10-01T20:04:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "wacowa",
      "rating": "5",
      "title": "Error",
      "content": "My WhatsApp keep telling me “unable to initiate call”",
      "date": "2025-10-01T19:46:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "MBNala",
      "rating": "1",
      "title": "Stickers icon",
      "content": "I click on Stickers icon and my WhatsApp freezes.",
      "date": "2025-10-01T19:16:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "↘️⬇️⤵️✖️❌💯",
      "rating": "2",
      "title": "Stupid app ever",
      "content": "Review kill every one of you there….how can you take down the account I have been using for over 6 to 7 years just because of a report made Accidentally…. The owner of this app is a fool and a loser….",
      "date": "2025-10-01T19:02:43-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Zatch’Mo",
      "rating": "5",
      "title": "Service",
      "content": "Easy to use. Very reliable",
      "date": "2025-10-01T18:22:46-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "NaiveCrow",
      "rating": "1",
      "title": "Terrible user experience",
      "content": "I cant still believe this app is as buggy as it is on iOS 17.7. App gets freezed when trying to view/download photos from groups, something that I have never ever seen happening in neither Android or Windows Phone.\n\nMaybe reduce the tracking and keep things simple, Meta :), otherwise might as well just cut communication through this platform like I did with FB on 2020\n\nSept 2025 update: on top of those bugs, AI is now forced upon us with no disable option :)",
      "date": "2025-10-01T17:51:44-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "??….????",
      "rating": "1",
      "title": "it’s broken",
      "content": "so i got whatsapp so i can facetime my friends that have samsungs and stuff reminder im 13+ and i put my birthday with my phone number and i chat my 3 friends “hi” each one of them and all of the sudden i get like banned or something and i cant use whatsapp for 24 hours and i had to like check my age or something? this doesnt make any sense fix it.",
      "date": "2025-10-01T17:29:04-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Jrahahayaa",
      "rating": "1",
      "title": "This app is the worst, trying to generate AI videos but this super annoying error keeps popping up!",
      "content": "0/10",
      "date": "2025-10-02T20:02:17-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Yakko Aly",
      "rating": "5",
      "title": "You are amazing",
      "content": "Your the best",
      "date": "2025-10-02T19:57:58-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "￼villa Lopez",
      "rating": "5",
      "title": "😍",
      "content": "100 stars",
      "date": "2025-10-02T19:44:17-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "ImDatCowboy",
      "rating": "1",
      "title": "Ads",
      "content": "Use to live YouTube, with the new update, I’m receiving an ad every 4-6 minutes. Atrocious",
      "date": "2025-10-02T19:42:50-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "NotroachR",
      "rating": "1",
      "title": "Why is age verification a think?",
      "content": "This is literally the most useless update I have seen so far this doesn’t protect nobody remove it",
      "date": "2025-10-02T19:34:46-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Brzhe TV",
      "rating": "5",
      "title": "Youtube we need to talk",
      "content": "Your amazing I mean we got kids watching you instead of cartoons",
      "date": "2025-10-02T19:32:07-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Brittswit",
      "rating": "5",
      "title": "Best online video platform",
      "content": "Excellent design & functionality. Love that I can find practically anything I want to watch on here too. 10/10",
      "date": "2025-10-02T19:31:33-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "JaySanford",
      "rating": "2",
      "title": "Harder to Search",
      "content": "Please bring back the search filters!   Need to be able to sort!",
      "date": "2025-10-02T19:13:08-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "rzwehbe",
      "rating": "1",
      "title": "Promoting genocide thru ads",
      "content": "I’ve come across so ads sponsored by YouTube covering international war crimes and human rights violations lately. Remove these ads immediately! Article 25 of the Rome Statute criminalizes “direct and public incitement to commit genocide.”  Google executives and employees expose themselves to international criminal liability by platforming these ads. It is appalling that Google would host ads dismissing a UN-confirmed famine while whitewashing and legitimizing war crimes and human rights abuses as thousands are killed. This is profiteering from propaganda that covers up genocide, and it is unlawful",
      "date": "2025-10-02T19:12:49-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Kylepar1968",
      "rating": "1",
      "title": "Way too many ads!",
      "content": "Way too many ads!",
      "date": "2025-10-02T19:12:49-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "De Jesus Lazo",
      "rating": "5",
      "title": "GOODNEWSOFGREATJOY",
      "content": "Jesus Is Lord Do Not Use The Lords Glorious Victorious Everlasting Precious Most High Name In Vain Jesus Loves You All Repent God Is Great God Is Good Jesus Loves You All Jesus Is King",
      "date": "2025-10-02T19:09:47-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "HeinsaluS",
      "rating": "2",
      "title": "YouTube needs to stop censoring things…..",
      "content": "Stop the censorship",
      "date": "2025-10-02T19:00:00-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "100%TRASH",
      "rating": "1",
      "title": "Premium Pricing is ridiculous",
      "content": "The ads ruin the experience and the pricing for premium is insane and simply not worth it. Loved the family plan but now I can’t even share it with them now that I’m moved out. Luckily all podcasts i watched on there are on different platforms so I won’t need youtube anymore.",
      "date": "2025-10-02T18:48:48-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Shotofhenny",
      "rating": "1",
      "title": "Ads",
      "content": "I miss the days where content creators were paid off of views as opposed to being sponsored or selling merchandise.",
      "date": "2025-10-02T18:42:15-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "😝😜😜😱🤗😊☺️",
      "rating": "5",
      "title": "YouTube is the BEST",
      "content": "YouTube has helped me in lots of diffrent ways like catching up in trends and learning new things. YouTube has helped  me with my SATS. How?, i watched YouTube tutorials and that’s how I got a 1590.",
      "date": "2025-10-02T18:34:37-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "# worst game ever",
      "rating": "3",
      "title": "It’s decent",
      "content": "I love YouTube but the amount of inappropriate bots or so called “clankers” is absolutely disgusting and so many people can be exposed to them by simply watching a video. YouTube really needs to fix this problem. And now the bots are making 30 second videos with a weird tittle and looks like a video of you know what. This sickens me as YouTube is an amazing platform and should NOT EVER have these bots",
      "date": "2025-10-02T18:34:27-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "adeiyayourfav",
      "rating": "5",
      "title": "YouTube",
      "content": "YouTube is a good app for kids you should download it for kids it has kid stuff and have memories of the things that you watch in CAM maker own video on it you should delegate it’s very fun I have it now it’s fine you can look up different stuff that you like and I’ll pop it in the video that you’re watching and you look up a different one it was not the video will not go off so if you don’t like the thing that you should searched up then you can watch the thing he was watching this is a good app for kids just to tell you.",
      "date": "2025-10-02T18:21:51-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "shortiefinest",
      "rating": "5",
      "title": "Love you tube",
      "content": "The videos are great  a lot of stories and music.It’s a lot on here that’s very helpful.",
      "date": "2025-10-02T18:21:26-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "ME5169",
      "rating": "5",
      "title": "Best value",
      "content": "Choices of content ie amazing. News,educational content 👷🏻‍♂️👷",
      "date": "2025-10-02T18:21:15-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "TamraJoD",
      "rating": "5",
      "title": "Fantastic App",
      "content": "Dr. Mandel is the Best!!\nWe need him. Everybody needs him. He’s Wonderful and totally Amazing. The Best app you could ever get. Download him you will love it. He gives Wonderful Knowledge to you and he Volunteers his time knowledge and Caring. \nHe’s the Best!!\n🌟🌟🌟🌟🌟\n👍🏼👍🏼👍🏼👍🏼👍🏼\n😊🩷😊🩷😊🩷😊",
      "date": "2025-10-02T18:14:43-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "SirSwampy",
      "rating": "1",
      "title": "Algorithm has destroyed the platform",
      "content": "Recent updates have made the algorithm down play the content I subscribe to, and elevate content I have no interest in. Several history themed and tech channels I have followed for years have lost views and videos to random algorithmic glitches where content that is decades old is suddenly subject to freak auto copyright claims or to misguided and inaccurate censoring. Fix the problems YouTube",
      "date": "2025-10-02T18:03:48-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Nate_318",
      "rating": "4",
      "title": "Compatibility",
      "content": "I installed a YouTube version that worked with iOS 12.5.7, because I’m on a 5s, used it for a LONG time, and just recently it keeps forcing me to try and update. I have newer devices but this is my main device, so it would be nice if they offered a YouTube legacy version for older devices and software, because the safari equivalent isn’t all that good",
      "date": "2025-10-02T18:02:54-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Kilo1!",
      "rating": "1",
      "title": "Offensive Content",
      "content": "There is a channel that keeps posting offensive and Antisemetic content, and it is making me upset. No matter how many times I’ve tried to block it, report it, and even ignore it, it continues to pop up as recommended content.",
      "date": "2025-10-02T17:57:17-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Ten misericordia de mí señor",
      "rating": "5",
      "title": "Me gusta",
      "content": "Me gusta",
      "date": "2025-10-02T17:56:18-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "ㅎㅐㅏㅐ",
      "rating": "5",
      "title": "Best thing ever",
      "content": "5 stars",
      "date": "2025-10-02T17:52:41-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Multiple apps in one 🎬",
      "rating": "5",
      "title": "BEST APP EVER",
      "content": "I love this app so much the only flaw it has is that it needs internet to work and that really stinks but other than that I am obsessed 💖",
      "date": "2025-10-02T17:40:52-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Mr biggin",
      "rating": "5",
      "title": "Best app ever",
      "content": "There is a lot of good entertainment I highly recommend",
      "date": "2025-10-02T17:38:33-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "ccilovehorses💖",
      "rating": "3",
      "title": "End censorship!",
      "content": "The American censorship of certain accounts needs to end.",
      "date": "2025-10-02T17:30:40-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "@StaceyReynolds",
      "rating": "5",
      "title": "I love it",
      "content": "I watch youtube 24/7 can u please take this ad on commercial off youtube platform. I’m not going to pay 18.99 cents of monthly",
      "date": "2025-10-02T17:26:44-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "meowmeow_princessg",
      "rating": "1",
      "title": "Greedy",
      "content": "Sick of a million ads in one short video",
      "date": "2025-10-02T17:25:10-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "linina$",
      "rating": "5",
      "title": "Beautiful",
      "content": "Music 😍",
      "date": "2025-10-02T17:19:32-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Hello superstates",
      "rating": "5",
      "title": "YouTube",
      "content": "I loved it but I need my viedoes from my channel to mak3 5hem public and I can’t get it on my channel anymore so I’m going to have you watch it and then you will help me get it back on the channel and then you can see if it can be puplic",
      "date": "2025-10-02T17:17:33-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Alexander9🇧🇩",
      "rating": "5",
      "title": "Jeyuso",
      "content": "Super cool 🆒",
      "date": "2025-10-02T16:59:19-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Sakuboyy1220",
      "rating": "5",
      "title": "YouTube video",
      "content": "Love",
      "date": "2025-10-02T16:40:09-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Leif5082",
      "rating": "1",
      "title": "Age verification",
      "content": "Why is Ai choosing my age!? I wanna watch the video I want! If I was a child I would use YouTube kids! And I’m not choosing to show my face, my driver’s license, or my ID! Too many ads, too! I’m sick of the ads! Whoever did this should get fired! While on fire! I’m so done with this. If I watch it on TV, there are 1 minute ads!",
      "date": "2025-10-02T16:34:57-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "W vtuber app",
      "rating": "5",
      "title": "Porn",
      "content": "Good for porn",
      "date": "2025-10-02T16:28:18-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Terrible Ads experience",
      "rating": "3",
      "title": "Terrible ads",
      "content": "YouTube is great, but I hope for better algorithms. Sometimes you put two ads at the beginning of a video. Both of them come after each other. And so far, none of the ads were of my interest. They are inaccurate, annoying, and disruptive. Moreover, you guys even put ads in the middle of songs and holy recitation!",
      "date": "2025-10-02T16:22:44-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "I’ll give you a five out of 10",
      "rating": "5",
      "title": "Gjxjd",
      "content": "Fjhd",
      "date": "2025-10-02T16:17:31-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Tony Wavyy",
      "rating": "5",
      "title": "Best app",
      "content": "I spend hours on this app it’s the best thing since sliced bread!",
      "date": "2025-10-02T16:16:20-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Has your heart gone cold?",
      "rating": "1",
      "title": "Concerning Israeli’s Filthy Propaganda",
      "content": "Youtube’s gotta remove these ads immediately. Article 25 of the Rome Statute criminalizes “direct and public incitement to commit genocide.”  Google executives and employees are exposing themselves to international criminal liability by platforming these ads. It’s appalling that Google would host ads dismissing a UN-confirmed famine while also whitewashing and legitimizing war crimes and the abuses of human rights as thousands are killed by Israel! This is profiteering from propaganda that covers up genocide, and it is absolutely unlawful and depraved.",
      "date": "2025-10-02T16:09:34-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "katya1994",
      "rating": "1",
      "title": "You pay for premium to still watch ads",
      "content": "Today I started seeing ads on the YouTube premium, do you consider this to be a good business practice? Good luck with this new policy",
      "date": "2025-10-02T16:05:41-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Mar mar mdtgv",
      "rating": "5",
      "title": "Love itttt",
      "content": "5⭐️⭐️⭐️",
      "date": "2025-10-02T16:03:44-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "AJTaitano",
      "rating": "1",
      "title": "Inappropriate Ads",
      "content": "I saw two separate ads that made me feel uncomfortable one was for an app that gives you a fake date and another showed a woman removing her underwear and using as a ponytail.",
      "date": "2025-10-02T16:02:58-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Skylar perez",
      "rating": "5",
      "title": "The best",
      "content": "I love this app",
      "date": "2025-10-02T16:00:30-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "DGR7391",
      "rating": "5",
      "title": "You Tube review",
      "content": "Grateful",
      "date": "2025-10-02T15:52:42-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "word with letter",
      "rating": "5",
      "title": "YouTube",
      "content": "This is a great place for me and others to make and view videos. Will never use any other platform but this one. Thank you YouTube.",
      "date": "2025-10-02T15:30:27-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "The-Emo-Kid",
      "rating": "1",
      "title": "Yall play too much.",
      "content": "YouTube you’re okay the videos are great but the problem IS—why yall gotta add ads to parts in videos that are about to go down? For example: A beat is about to drop and then I get a ad from Walmart. 😐 c’mon now.",
      "date": "2025-10-02T15:27:06-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Yank kale",
      "rating": "5",
      "title": "Cindy Crawford",
      "content": "I love the Pepsi commercials by Cindy Crawford, reminds me of when I was in my 20’s",
      "date": "2025-10-02T15:24:01-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "J̶o̶n̶a̶t̶h̶o̶n̶",
      "rating": "4",
      "title": "I like it SO much but I think TikTok better",
      "content": "It's good but all the cringey stuff like toper guild and stuff it's just pmo",
      "date": "2025-10-02T14:46:53-07:00",
      "version": "20.39.6",
      "appId": 544007664,
      "appName": "YouTube"
    },
    {
      "author": "Crkdaisyy",
      "rating": "5",
      "title": "my friend got banned forever just for this....",
      "content": "tiktok is a pretty decent platform. I scroll on tiktok everyday. but im thirly disappointed in the results of my friend posting her face. she's 13, and posted relatable vids about anything. until her friend, aka her enemy decided to report her. here's why i deny that two digit ages under 14 or ARE 14 can't post faces. 12-14 teens who could be in md ( middle schoolers) could have the right to post a bit of their face?.. at least its not ages 3-11. and PLEASE fix your moderation. i completely disagree with permanently deleting a teen's account just for posting their face. even if its for safety, tiktok's moderation shouldn't ban a person who loves to scroll on tiktok. in general its not fair at all. and it's not a good look on tiktok. the platform is getting pretty messed up nowadays because of the latest videos that have been posted lately. and there is very very inappropriate videos that the tiktok moderation never cares about. and yet my bestie boo gets her account deleted just for posting a video of her face? she's clearly a teenager now. fix this platform AND the app. it's totally pretty messed up by the look of its position right now.",
      "date": "2025-10-02T20:30:25-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "moderation brk",
      "rating": "1",
      "title": "Why I keep getting banned",
      "content": "I didn’t do anything and i have parental control and it always bans me for no reason fix ur moderation. Please and thank you.",
      "date": "2025-10-02T20:17:10-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Blah blah blah 52",
      "rating": "1",
      "title": "Sorry not sorry",
      "content": "This app is truly sorry. There, I said it.",
      "date": "2025-10-02T20:07:21-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "EliJohnHunter",
      "rating": "1",
      "title": "Im done with everything social media",
      "content": "i hate tiktok and all\nsocial media so much and how even social media ruins relationships and gets in the way of everything i deleted my tiktok account im done this is too much doom scrolling every morning im sick and tired of it all",
      "date": "2025-10-02T19:43:10-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Billybuddd",
      "rating": "4",
      "title": "I cant comment pictures",
      "content": "My app is fully up to date but i cant comment pictures, is it because i have an iphone 11?",
      "date": "2025-10-02T19:39:27-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Kaspoto",
      "rating": "1",
      "title": "Zioapp",
      "content": "This app is deeply problematic and I cannot recommend it. It actively suppresses freedom of speech, silencing users who express legitimate concerns or alternative viewpoints. Even worse, it has shown open support for harmful and unacceptable causes, including endorsing or enabling content tied to genocide. This is not just disappointing—it’s dangerous. Until the platform changes its policies and takes accountability, I strongly advise others to avoid it.",
      "date": "2025-10-02T19:30:48-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "lilblock",
      "rating": "1",
      "title": "RIP Tik Tok",
      "content": "Tik tok used to be cool. Now it’s run by the 🧃RIP",
      "date": "2025-10-02T19:30:22-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Noheiriarte1",
      "rating": "5",
      "title": "Muy buena app, me encanta para pasar entretenida",
      "content": "la recomiendo muy buena",
      "date": "2025-10-02T19:06:37-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Trinityuser-zb",
      "rating": "1",
      "title": "why you banned me for nothing",
      "content": "so I was on live a and they banned me for being on there but I didn’t even say anything at all and someone banned the live with me on it as a guest and I didn’t even do a thing and I appealed four time they didn’t answer so in that case your getting  a one star review until you get me my account",
      "date": "2025-10-02T18:34:20-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Dominick Davis",
      "rating": "5",
      "title": "Dominick Beyoncé",
      "content": "Davis",
      "date": "2025-10-02T18:32:21-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Texan 95",
      "rating": "1",
      "title": "Nothing but problems",
      "content": "Ever since I updated it it’s glitching and freezing",
      "date": "2025-10-02T18:26:21-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Gamer stop being",
      "rating": "1",
      "title": "TikTok",
      "content": "Why would u ban me there was no reason I was making videos about dolls and there was no reason to ban me please unban me I don’t know why but my name was audrionnasluckys",
      "date": "2025-10-02T18:24:28-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "XIV_KY",
      "rating": "4",
      "title": "Good",
      "content": "I can’t load accounts I tried everything pls fix your app and I may consider making it five stars",
      "date": "2025-10-02T18:16:27-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "nettspend__",
      "rating": "1",
      "title": "trash",
      "content": "banned all of my accounts for no reason",
      "date": "2025-10-02T18:15:49-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Asiankiddooo",
      "rating": "5",
      "title": "very good",
      "content": "amazing app this is so good bro i love this app this is so good that i love everything on this i hope you give me photo mode but if you dont ill be ok so please have a good day bye",
      "date": "2025-10-02T18:12:13-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Faye’s Japan Trip 2025",
      "rating": "5",
      "title": "Japan Trip September 2025",
      "content": "We recently returned from an unforgettable 11-day trip to Japan with a group of 16, and I cannot thank Eric Miles and the team at Travel Centre enough for their outstanding service. From start to finish, every detail was handled with the highest level of professionalism and care.\n\nEric assisted with booking flights, arranging hotels, coordinating transfers, and organizing day trips, all of which were executed seamlessly. The attention to detail ensured that our entire itinerary ran smoothly and stress-free, allowing us to fully enjoy the experience without any concerns.\n\nThis was truly a trip of a lifetime, and it would not have been possible without the expertise and dedication of Travel Centre. I highly recommend them to anyone considering a journey to Japan—or anywhere else—for a flawless and memorable travel experience.\n\nThank you again, Eric, for making this trip extraordinary.",
      "date": "2025-10-02T17:57:46-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "getshak",
      "rating": "1",
      "title": "Tik Tok became Zionist",
      "content": "Tik Tok has been taken over Zionist supporters and no longer supports the freedom of speech and first amendment",
      "date": "2025-10-02T17:51:53-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "DJwalls2007",
      "rating": "1",
      "title": "I miss the old TikTok",
      "content": "I hate new and inappropriate audios I’m 11 years old and what’s worse is that when I take photos they give me a Audio called Beethoven balls TikTok is so wild guys so next time TikTok bring back the 2018 TikTok you are so racist so please I want you to stop",
      "date": "2025-10-02T17:43:49-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "gg481",
      "rating": "3",
      "title": "TikTok",
      "content": "This is a great app but recently it has been playing random music when I open the app and continues to play over the TikTok audios. I have an iPhone 16 so I’m sure it isn’t because of an update. I’ve turned off my phone and deleted and reinstalled the app and it is still happening.",
      "date": "2025-10-02T17:38:42-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "perfecttiming50",
      "rating": "1",
      "title": "Locked name Issues",
      "content": "I really don’t like the prolonged period for name changes. I’m trying to play with different name formats for my online business. At least give 3 tries before it locks up for a month! Ew I just found out that Isreal owns this app now? As if we need their ignorance and evil presence in 4k now.",
      "date": "2025-10-02T17:30:51-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Meee.).?:(8;?$8.",
      "rating": "1",
      "title": "No",
      "content": "Algorithm that forces politics in your feed",
      "date": "2025-10-02T16:19:08-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "TylerCorsa",
      "rating": "1",
      "title": "Banning juice emote",
      "content": "The banning of free speech should never be accepted.",
      "date": "2025-10-02T15:43:11-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Vincy_artworks",
      "rating": "4",
      "title": "It’s good but",
      "content": "Can 13 yr olds go live please",
      "date": "2025-10-02T15:32:36-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "$an-Kay",
      "rating": "1",
      "title": "Jesus Christ",
      "content": "Thank you TikTok; for existing",
      "date": "2025-10-02T15:21:57-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Cåmï",
      "rating": "1",
      "title": "Full of Scams & Pedos",
      "content": "Although there’s a good community of people on here that do crazy things, I get my account banned all the time because my PRIVATE ARCHIVES (WHICH ARE NOT INFLUENCING ANYBODY BECAUSE HOW WOULD THEY ITS PRIVATE…) do no meet community guidelines. I’ve seen a woman breast feeding her baby fully undressed on this app just for content and to get attention from weird men but yet when I reported that there was nothing done about it. Not to mention the several times this app uses a biased algorithm as well as trying to check the content I repost. After Trump made this app meta I knew it wasn’t what it used to be. What a joke.",
      "date": "2025-10-02T15:20:50-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "peebles.rsa",
      "rating": "1",
      "title": "protects abusers",
      "content": "today i received a clickbait notification about D4vd being “declared officially not guilty.” tell me how can someone be officially not guilty with no trial?",
      "date": "2025-10-02T15:16:20-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Trjorge89",
      "rating": "3",
      "title": "Too many scammers on the app",
      "content": "I know this is a problem everywhere but TikTok seems to do nothing about all the fake accounts trying to message you and scam you in here. Wish they’d take it more seriously they are in DMs and lives trying to scam people you report them and nothing is done.",
      "date": "2025-10-02T15:10:38-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Gemini6671",
      "rating": "2",
      "title": "Update",
      "content": "You need a new update. I can’t watch anyone’s TikTok’s they send me. It sends me to the App Store to open tik tok and it’s always the wrong video",
      "date": "2025-10-02T15:07:39-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Uscitizen1776",
      "rating": "1",
      "title": "📸",
      "content": "Decent surveillance software",
      "date": "2025-10-02T14:57:06-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "kad1na",
      "rating": "1",
      "title": "Violation",
      "content": "I am unable to send any TikTok‘s to my friends because it keeps saying the message is a violation but my account is in good standing",
      "date": "2025-10-02T14:49:31-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "c ooooooo",
      "rating": "1",
      "title": "terrible",
      "content": "just terrible and a money scam",
      "date": "2025-10-02T14:44:05-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Garnet_0227",
      "rating": "5",
      "title": "10/10",
      "content": "I like tik tok yes but I hate it when I get false age restricted, and then I can’t text my friends like yes it’s a good feature, but have a way to remove it cause sometimes it’s annoying",
      "date": "2025-10-02T14:29:57-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Wwdsd5",
      "rating": "1",
      "title": "Oy Vey",
      "content": "I think we all know the deal…",
      "date": "2025-10-02T14:28:38-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Emily99704",
      "rating": "1",
      "title": "Can’t reply messages",
      "content": "I can’t reply to my messages why? \nWhen did TikTok become this difficult??\nPls do something",
      "date": "2025-10-02T14:12:42-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Rei41",
      "rating": "2",
      "title": "CHANG IPAD REPOST OPTIONS",
      "content": "Please change in the iPad were you click a video to either repost or share change it back to how it was I hate that it is super big takes my whole screen",
      "date": "2025-10-02T13:48:51-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Imani1hundred",
      "rating": "1",
      "title": "Don’t download",
      "content": "Stupid app deleted my entire edited video. Would not let me remove template. Highly wouldn’t recommend downloading this app.",
      "date": "2025-10-02T13:44:09-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Unicorn everie",
      "rating": "5",
      "title": "This is cool but...",
      "content": "I love tt but now we have to download a new app.. I learned this on YouTube. Why is it called m2? That sounds like YouTube but a little better. Also some opinions for tt: I lovee the filters and stuff. TS IS SO FUNNN.. #2:ilysm tt.. U literally made \"saves\". Also I love that YouTube, roblox, and Netflix made their account here. \n\nTy for reading this guys/girls/tt.",
      "date": "2025-10-02T13:39:15-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Alexandra$26",
      "rating": "1",
      "title": "Drains battery",
      "content": "Doesn’t matter what settings I use or how much I limit usage, this drains my battery like crazy, to the point my phone gets hot. Check your battery usage stats, I got mine replaced a few weeks ago, and TikTok is still the main culprit and I’ve reinstalled it many times.",
      "date": "2025-10-02T13:33:16-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Bubba 😠",
      "rating": "1",
      "title": "Why change the rules now.",
      "content": "Will be leaving the platform of this new rule goes in. I’ve stored pictures and videos here because it was available now to tell me I’m gonna loose all photos of my kids and family. You’ve lost me.",
      "date": "2025-10-02T13:23:09-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Shy_shy_moon",
      "rating": "1",
      "title": "Won’t load my own post",
      "content": "I posted two new TikTok’s yet I CAN NOT see them yet others can!? Why is that TikTok? I’ll change my review when you FIX your own SYTEM",
      "date": "2025-10-02T13:23:07-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "bernardsonkarl",
      "rating": "1",
      "title": "I can’t message coldexit1",
      "content": "Una dey mad abi watin make una open my messages na no worry I just give you guys 24hrs if not am deactivating this account for good and will never open it",
      "date": "2025-10-02T13:10:35-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Crow1033",
      "rating": "1",
      "title": "Banned for no reason. Zero stars if I could.",
      "content": "My account was banned out of the blue. They’ve say community guideline violations, but I haven’t posted any videos or comments for almost a year. I’ve asked for specific examples, and none were provided, no email notifications regarding said supposed violations, nothing. And to top it all off, even after I appealed, and still asked for specific examples of the supposed violations, none were provided. This is was a good app until it wasn’t.",
      "date": "2025-10-02T12:57:47-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Drmelanin",
      "rating": "1",
      "title": "Liar",
      "content": "Y’all are bad liar to little kids and a lot of these little kids are believe y’all liar  now so this is what y’all get for lying to these little kids and everything on the TikTok shop should be free for everyone",
      "date": "2025-10-02T12:50:01-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "iplulu",
      "rating": "5",
      "title": "Lulu",
      "content": "No me abre Tiktok",
      "date": "2025-10-02T12:44:13-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Cheybabe100",
      "rating": "1",
      "title": "Not working",
      "content": "My acct got restricted because they say Im not old enough almost thirty been put in my bday now they asking for verification and an image of an ID absolutely not give me back my acct and stop playing",
      "date": "2025-10-02T12:23:36-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "HandOfDoom18",
      "rating": "1",
      "title": "Abuse",
      "content": "Literally thousands of videos of animal abuse and not one video gets taken down.",
      "date": "2025-10-02T12:14:20-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "BepisTheGreat",
      "rating": "1",
      "title": "No photo comments.",
      "content": "iPhone 16 pro max, 1TB storage. Can’t post photo comments, but my wife’s iPhone 16 plus can? Very strange how that works.",
      "date": "2025-10-02T11:56:39-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Bystrod501",
      "rating": "5",
      "title": "Нету репостов",
      "content": "Нету репостов, помогите пожалуйста",
      "date": "2025-10-02T11:55:23-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Sunil_agrawal1",
      "rating": "5",
      "title": "Unfreeze",
      "content": "Unfreeze my account",
      "date": "2025-10-02T11:47:44-07:00",
      "version": "41.8.0",
      "appId": 835599320,
      "appName": "TikTok - Videos, Shop & LIVE"
    },
    {
      "author": "Kill all clankers",
      "rating": "1",
      "title": "Clanker",
      "content": "Spotify is putting in clanker TINSKIN music in their playlist damm mother board crunching droid brains",
      "date": "2025-10-02T20:17:13-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "David Hughes King",
      "rating": "5",
      "title": "WHOAW!",
      "content": "I’m 45 and my first time being on Spotify! Needless to say I’ve been missing out. Spotify is like YouTube, YouTube Music, Apple Music, Apple Podcast, Audible, Pandora, Sirius XM, all in just one app. Sound quality is just amazing. Love it!",
      "date": "2025-10-02T20:15:50-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "calcsff",
      "rating": "5",
      "title": "ts is amazing",
      "content": "i love spotify and its one month deal of premium",
      "date": "2025-10-02T19:57:47-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Bobby Jo Barton jr.",
      "rating": "1",
      "title": "Adds",
      "content": "So many adds",
      "date": "2025-10-02T19:44:06-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Stinky fart bomb",
      "rating": "5",
      "title": "Spotify ily.",
      "content": "This app is so amazing, music has gotten me through my darkest nights I enjoy the ads sometimes, they make me laugh when I cry because there unexpected.",
      "date": "2025-10-02T19:40:21-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Lilyanalove<3",
      "rating": "5",
      "title": "67",
      "content": "It’s so peak🥹🥹",
      "date": "2025-10-02T19:27:00-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Sigmaboi1038",
      "rating": "5",
      "title": "Yes",
      "content": "Very good songs you can find you can find and listen to Amy songs for free",
      "date": "2025-10-02T19:26:08-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "!🍁🍂KINSLEY🍂🍁!",
      "rating": "4",
      "title": "I love Spotify but…….",
      "content": "I love Spotify but I hate that I have to pay to pick the song that I want to play 😭…. But otherwise I love Spotify!!!",
      "date": "2025-10-02T19:16:57-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Rodrigo072",
      "rating": "5",
      "title": "THIS IS THE BEST THING TO LISTEN TO MUSIC",
      "content": "ITS ACTUALLY SUPER GOOD I COUD LISTEN TO MY FAV MUSIC PLAYING GAMES !",
      "date": "2025-10-02T19:16:46-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "“9184",
      "rating": "5",
      "title": "Sigma",
      "content": "Sigma",
      "date": "2025-10-02T19:12:16-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Hiking Mama1989",
      "rating": "5",
      "title": "Spotify Fan!",
      "content": "I’m loving Spotify Premium",
      "date": "2025-10-02T19:07:43-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "._.Rin._.",
      "rating": "1",
      "title": "pay to use basic features you should already have",
      "content": "literally impossible just to play the music you want, they make you pay every month to skip, and they make you pay just to choose a song to listen to.",
      "date": "2025-10-02T19:03:22-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "law022189",
      "rating": "5",
      "title": "❤️",
      "content": "💕",
      "date": "2025-10-02T18:58:56-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "ava Zaatar",
      "rating": "5",
      "title": "This app is amazing!!!!",
      "content": "I love using Spotify to listen to music. It is so easy to make playlists and I love there podcasts.They have every single song you could think of!!  I LOVE THIS APP DEFINITELY \nRECOMMEND.",
      "date": "2025-10-02T18:51:57-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Anonymous Oreo101",
      "rating": "5",
      "title": "Good but mainly with premium",
      "content": "Listen, the apps got a lot of good music and everything yes yes. There are a lot of nice features. But, they recently gave all non premium users the ability just to PICK what sling they wanna play and it plays. But after a while it goes back to not letting us, just being an advertisement for premium AGAIN. I don’t mind the ads too much but COME ON. Y’all are a music app and can’t let people hear what they wanna hear when they wanna hear it?? That is the bare MINIMUM for a MUSIC app. What kind of music app doesn’t let you play the song you want when you want it, instead I got whole playlists similar to the song.  Not asking you guys to make premium free but at least just let us choose our songs when we want them, this is just money greedy.",
      "date": "2025-10-02T18:48:54-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "*\\•Lora•/*",
      "rating": "3",
      "title": "Love it but..",
      "content": "Okay soo.. just recently Spotify seemed to update and I’m not exactly the happiest abt it. I love Spotify, don’t get me wrong, but this new update is kinda ridiculous to me. Before the update, I could scroll through and choose songs as I pleased without premium, idk if it was a glitch or whatever, but the new update still lets you pick random songs that you wanna listen to, but only a certain amount, and I’m honestly not liking it. Ik you may be like, “just buy premium” but what I’m saying is that I could pick songs freely, without premium, and yet I’d still get ads, so it obviously wasn’t premium. But now it limits it to only like, 6 songs you can choose freely. The rest you just have to listen on shuffle. I don’t like this update, because it makes you have to get premium to LITERALLY do what I was ALREADY doing before the stupid update. Spotify, why bro? ✋😭 Can you please just make it go back to how it was? I still had ads and stuff, so, like I said, it wasn’t premium. But now you making me buy premium just to listen to more than 6 songs?? Okay…",
      "date": "2025-10-02T18:40:35-07:00",
      "version": "9.0.48",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "LuvGames25",
      "rating": "1",
      "title": "Fix the playlist cover size!!",
      "content": "Why did you guys make the playlist image covers so small???? The newer layout is awful because you can’t see the picture that well, and it cuts off the text if the playlist title is long. I don’t get why you changed it. Totally unnecessary! So many users put time and effort into playlist covers and you’ve ruined it. And it isn’t just me; I’ve seen community threads on Spotify with pages and pages of people complaining about this issue for months, but still no changes. I keep updating the app hoping it will change but it hasn’t. Please listen to your customers! At least make it an option to change it back to the larger size/layout. We signed up and paid for the app in the first place because we liked how it worked already, so don’t make unnecessary changes like this that worsen the user experience.",
      "date": "2025-10-02T18:30:17-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Li’l B",
      "rating": "5",
      "title": "Spotify",
      "content": "SOOO MUCH GOOD SONGS",
      "date": "2025-10-02T18:18:18-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "the real crooks",
      "rating": "1",
      "title": "Disgusting practices",
      "content": "They make you have an account in order to play songs in a playlist",
      "date": "2025-10-02T18:18:16-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Gwackertwack",
      "rating": "5",
      "title": "School",
      "content": "I honestly love listening to music in school cause it like helps me focus and stuff like that so Spotify is definitely something everyone needs on their phone",
      "date": "2025-10-02T18:17:34-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Theoneandonly12385",
      "rating": "5",
      "title": "Amazing app",
      "content": "This app is overall great. There are wide selections of songs both dirty and clean. Easy to figure out and doesn’t take long to make a playlist.",
      "date": "2025-10-02T18:11:33-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Sofi 💚",
      "rating": "5",
      "title": "No hay mejor",
      "content": "Es muy bueno está toda la música \nEs la app q siempre soñé",
      "date": "2025-10-02T18:10:53-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Miralahart",
      "rating": "5",
      "title": "Love it",
      "content": "Weeeeeee",
      "date": "2025-10-02T18:09:30-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "El maluma 42",
      "rating": "5",
      "title": "Bendiciones",
      "content": "Con toda la Fe",
      "date": "2025-10-02T18:02:58-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "RiverOP123",
      "rating": "5",
      "title": "Best",
      "content": "Best music app ever the only thing it’s does not have unlimited music",
      "date": "2025-10-02T17:32:00-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Raven77777!",
      "rating": "1",
      "title": "No",
      "content": "They tricked the non-premium users gave them free skips in the ability to choose their own song for like a week and then took it away all because the rich people complained. Someone please tell me an app that I can choose my own song and skip the songs I don’t like, but also I can listen to while my phone is off For free. I listen to Spotify because it’s the only app that doesn’t drain my phone as much and my phone can be off.. Spotify, you guys just lost another customer even though I wasn’t paying still.",
      "date": "2025-10-02T17:25:12-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "SraGr247",
      "rating": "2",
      "title": "How long it takes",
      "content": "2 stars takes literally like 20 min. To work!! 2 stars",
      "date": "2025-10-02T17:22:27-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "SalubriousSasquatch",
      "rating": "1",
      "title": "Free version is bad",
      "content": "If you don’t pay for a subscription, this app is virtually unusable for anything but podcasts due to inability to select songs and volume of ads.",
      "date": "2025-10-02T17:21:31-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "tiffany mayumii",
      "rating": "1",
      "title": "greedy asl 😂✌️🌹",
      "content": "top 10 worst streaming apps ✌️ they’re greedy and don’t even let u play ur own playlist 🥹 like NO i don’t want to listen to two twins twerking in japan. turn my clairo back on lil bih 😂💔",
      "date": "2025-10-02T17:09:59-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Ralpeople",
      "rating": "2",
      "title": "Ads bad",
      "content": "To manny",
      "date": "2025-10-02T17:09:54-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Alii~",
      "rating": "1",
      "title": "Fix your stupid app",
      "content": "It was FINE until you guys decided to add the smart shuffle. If the song is NOT ON MY PLAYLIST WHY PUT IT THERE AND THEN NOT LET ME SKIP IT BECAUSE I ONLY HAVE 6 SKIPS??? You'd think that a music app would let you listen to the songs YOU WANT TO LISTEN TO. Spotify Premium is so expensive for features that should be FREE. You should be able to skip and go back how many times you'd like AND PICK THE SONG YOU WANNA LISTEN TO???? If I click on a SPECIFIC ALBUM i want to listen to songs IN THAT ALBUM, I DONT CARE ABOUT THE OTHER RANDOM SONGS. Im so close to just uninstalling spotify and switching to a different music app. Also having ads is understandable but 6 WHOLE MINUTES OF 30 SECOND ADS AFTER LIKE 2-3 SONGS? I'd rather just listen to the radio at this point.",
      "date": "2025-10-02T17:04:52-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "mussic forever ✌🏽",
      "rating": "5",
      "title": "I love music ✌🏽",
      "content": "I think this app is great! I now a bunch of new songs because of this app but sometime there’s a lot of ads. 😅But anytime u look up a song the app will show u songs kinda like that!",
      "date": "2025-10-02T17:01:01-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Hegehhs6sts",
      "rating": "5",
      "title": "I LOVEE",
      "content": "new update made spotify 100X BETTER",
      "date": "2025-10-02T17:00:24-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Samba-net",
      "rating": "5",
      "title": "Vibes upon vibes",
      "content": "🎶🎧",
      "date": "2025-10-02T16:58:14-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "7265 puppies",
      "rating": "4",
      "title": "Ads",
      "content": "The ads mess up the song and the mood",
      "date": "2025-10-02T16:55:54-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Sheinthant",
      "rating": "5",
      "title": "Good",
      "content": "I like spotify",
      "date": "2025-10-02T16:44:47-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "bjjaszcz",
      "rating": "2",
      "title": "Abysmal user interface",
      "content": "Imagine a listening platform that loses your place in podcasts multiple times a day, or when you pause it, autoplays the moment you reopen the app. Imagine designing a home screen that rearranges right as you’re about to make a selection. These are no longer bugs on in the Spotify app, they’re features, because they’ve survived generations of updates without ever being addressed. Maybe these quirks are a minor inconvenience half of the time, but when you’re driving and you lose your spot there’s no simple voice command for getting back to where you left off. It makes me wonder how many drivers I see looking down while going through an intersection are Spotify users.",
      "date": "2025-10-02T16:40:23-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Bobbyrizz67",
      "rating": "5",
      "title": "Hi",
      "content": "Good",
      "date": "2025-10-02T16:33:33-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Unpleasecustomer............",
      "rating": "1",
      "title": "Unethical Company",
      "content": "Spotify is unethical for so many reasons—artist compensation, and backing literal WAR efforts. I’ve moved to Tidal. Boycotts work yall.",
      "date": "2025-10-02T16:26:14-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Sincerely ironic",
      "rating": "1",
      "title": "They use Ai and treat their artists poorly",
      "content": "They already had bad rates but now they want to use your music to train AI and they have the right to produce it and pay you terrible. Pretty looser energy there :/",
      "date": "2025-10-02T16:22:00-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "🥹✌️💔",
      "rating": "2",
      "title": "Spotify review",
      "content": "I’m SO sick of the ads after EVERY song stop being money hungry💔and the fact I can’t pick which song I wanna play. Like you just had it where I could pick the song, and now it’s limited all of the sudden. If your going to give me ads after every 2 songs 💔AND not let me turn off my shuffle, AND not let me pick the song AND make the shuffle trash then your just a bad company that’s money hungry 💔well guys back to musi I go cuz Spotify pmo🥹😍✌️",
      "date": "2025-10-02T16:21:37-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "This was a nice app",
      "rating": "5",
      "title": "It’s a nice app",
      "content": "It’s just a good app it’s nice just a music app :D",
      "date": "2025-10-02T16:15:58-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Tekruh",
      "rating": "1",
      "title": "Bugs",
      "content": "So buggy as of lately, lock in",
      "date": "2025-10-02T16:15:02-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "ONLY ADD 5 STARS FOR SEE!!",
      "rating": "5",
      "title": "Pls yes ye yeyyfggbebuberh g gre",
      "content": "Uhhhhyessss",
      "date": "2025-10-02T15:59:07-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "ushsnsbshs",
      "rating": "1",
      "title": "Too many ADS",
      "content": "There’s so many ads I get overwhelmed it’s so annoying it’s a good app but there’s just way too many ads it’s aggravating",
      "date": "2025-10-02T15:51:15-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Abigail Ward",
      "rating": "4",
      "title": "On my nerves, but I still love it",
      "content": "I don’t really like how there’s a lot of ads versus between two songs. I just don’t really like it.\nSorry",
      "date": "2025-10-02T15:47:13-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Robert H. from Maui, HI.",
      "rating": "5",
      "title": "Occasionally it glitches",
      "content": "Mostly great 😎",
      "date": "2025-10-02T15:46:02-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Giraffgirl88440",
      "rating": "5",
      "title": "Very appreciated",
      "content": "I love it has barely any ads can make playlist follow and there is clips by some of your favorite artist you can follow and I recommend seriously any age it is great please get the app it is free fun and easy and you will use it a lot you can share playlist with friends and they can add to it I recommend greatly 😄😃👍👏👏👏👏😃😄🙂‍↕️🫡🙂‍↕️🫡",
      "date": "2025-10-02T15:25:00-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "Grunge style<3",
      "rating": "1",
      "title": "Me myself and I",
      "content": "This is not fair before there were no adds and unlimited skips and u can be all happy and everything not paying for anything but now u have to pay and some people are not rich or don’t have money this is such a rip off im deleting the app i used to love it but now i don’t please change it how it how it was before thank u",
      "date": "2025-10-02T15:23:46-07:00",
      "version": "9.0.84",
      "appId": 324684580,
      "appName": "Spotify: Music and Podcasts"
    },
    {
      "author": "My aaay",
      "rating": "5",
      "title": "5 star",
      "content": "Always",
      "date": "2025-10-02T20:04:30-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "leigh6!",
      "rating": "4",
      "title": "marketplace.",
      "content": "i think that marketplace should let people use it even if they are not 21 market place is very useful for people that need to find things you should make it to where you don’t have to have a age requirement.",
      "date": "2025-10-02T20:03:06-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Hollandkp",
      "rating": "5",
      "title": "Friendly",
      "content": "Friendly atmosphere that really helped me get my message across several platforms.",
      "date": "2025-10-02T19:21:50-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Camping beast",
      "rating": "1",
      "title": "Get over the poke weirdos",
      "content": "What moron thought it would be a good idea to put the poke button on profiles where the old settings button used to be?? Who the f even pokes anymore?! It’s 2025 move on ya weirdos",
      "date": "2025-10-02T19:15:01-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Sleepless AZ",
      "rating": "2",
      "title": "Constant issues",
      "content": "I manage a page with over 144k members. The app constantly throws messages saying opps we’re getting that fixed or page unavailable while trying to approve members to participate. Also, when I go to page, I can see first 6-10 posts then it throws if back to the top again and I have to start over scrolling. Over and over again we again. I use the fb app on an iPhone 14 Plus pro.",
      "date": "2025-10-02T19:02:21-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Lilmama23b",
      "rating": "1",
      "title": "Facebook trouble",
      "content": "Facebook dating notifications isn’t poppping up on my lockscreen",
      "date": "2025-10-02T18:43:08-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Terrible la berdad",
      "rating": "1",
      "title": "Es malicima",
      "content": "Es malicima están inhabilitando todas las cuentas,literalmente acabe de crear una y duro 2 hs y ya la volvieron a inhabilitar no es posible ya no tengo cómo recuperar mis fotos ni mis contactos",
      "date": "2025-10-02T18:42:08-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "FoMoCo1",
      "rating": "1",
      "title": "Horrible",
      "content": "There’s no way this horrible app has four something stars now onto what I really came here for it because now there’s nothing in my newsfeed that I wanna see is all sponsored pages want me to follow them? I really don’t care about you or any of your other pages. I only wanted to see the stuff I never liked this app that well in the first place and I’m liking it even less.",
      "date": "2025-10-02T18:39:30-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "hijo del mil putas",
      "rating": "2",
      "title": "Efecto",
      "content": "Deberían de cámbales esos efectos ya que mo son buenos deberían de poner otros mejores",
      "date": "2025-10-02T18:39:05-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "icky29486749385",
      "rating": "1",
      "title": "Obvious scams everywhere",
      "content": "I can’t actually believe that Face Book actually allows all of the SCAM advertising. When someone has a $20000 machine listed for $600 you know it’s a scam. You report it and Facebook says we see nothing wrong. SHAME.",
      "date": "2025-10-02T18:31:27-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Rohkel",
      "rating": "5",
      "title": "Under new management",
      "content": "A great bunch of new people now working on most makes and models of small engine engines.",
      "date": "2025-10-02T18:28:58-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "240front",
      "rating": "2",
      "title": "Stops music upon exit",
      "content": "The most recent update inexplicably stops any music that you have playing when leaving the app. Please fix this.",
      "date": "2025-10-02T18:26:07-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Pitbi2L",
      "rating": "4",
      "title": "I Love Facebook and it hurt that I was seen as something I’m not hacked stalked incriminated",
      "content": "I know my original account was banned for some hackers doing and myself made to look like a bad guy for something unknown to me the full who what when where why how but it wasn’t fun. It’s cyber bullying and extortion terrorism. Life ruining reputation education social circle and I apologize for any inconvenience or misunderstanding and me not keeping my account safe apparently. I hope to start fresh and portray the real me. Thanks",
      "date": "2025-10-02T18:19:36-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "roberto. barbarino",
      "rating": "5",
      "title": "Uomini coraggiosi",
      "content": "Il loro tentativo ,che già sapevano senza speranza  è un Atto politico e una sfida al potere di stati governati da dittatori supportati da  una parte del Popolo ormai insendibile all’Umanita ed accecato dai propri interessi. Ma non tutto il popolo è Cieco . Chi sa vedere agisca.",
      "date": "2025-10-02T18:09:44-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Torben Villegas",
      "rating": "5",
      "title": "Grandioso",
      "content": "Me encanta",
      "date": "2025-10-02T18:04:14-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "dhauffe",
      "rating": "1",
      "title": "Effective for most tasks",
      "content": "The latest update shuts down audio playback from other apps. That’s overreaching. Shut down your own audio, but don’t interrupt my book.",
      "date": "2025-10-02T18:02:42-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Omero Pérez",
      "rating": "1",
      "title": "Necesito mi cuenta esta inhabilitada tengo cosas muy importantes en Facebook que necesito…mi nombre",
      "content": "Mi hombre es Omero Pérez lo necesito porfa regrésame mi cuenta 😭😭",
      "date": "2025-10-02T17:55:07-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "DaleShaver",
      "rating": "1",
      "title": "Captures and closes audio from other apps",
      "content": "As of the latest update October 1, 2025, the Facebook app captures and closes audio from any other app when switching from Facebook to anywhere else.",
      "date": "2025-10-02T17:42:23-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "lonephoenix420",
      "rating": "1",
      "title": "Used to love, miss MySpace",
      "content": "I used to love this app it was meant to connect with new people and reconnect with old friends but now it’s nothing more than force fed ads for things I have no interest in, or are highly inappropriate and the more spam and garbage you report the more finds its way to your feed",
      "date": "2025-10-02T17:39:16-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Little hat hatter",
      "rating": "1",
      "title": "Zog slop",
      "content": "It’s run by Jews",
      "date": "2025-10-02T17:36:12-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "NicholasRyanSocial",
      "rating": "1",
      "title": "Broken",
      "content": "Whenever I close the app it pauses my Apple Music. This is a newly broken update and needs to be fixed.",
      "date": "2025-10-02T17:26:11-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "World Musicman",
      "rating": "5",
      "title": "Facebook",
      "content": "Rock Star",
      "date": "2025-10-02T16:59:16-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Alexkewl",
      "rating": "1",
      "title": "Fix",
      "content": "I keep closing my FB app and my music keeps turning off with it. WTH!!",
      "date": "2025-10-02T16:53:41-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "kdub1212",
      "rating": "5",
      "title": "Outstanding Work",
      "content": "Excellent and detail diagnosis and diligent and detailed repairs. Highly recommended and reasonable priced.",
      "date": "2025-10-02T16:52:28-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "daziemoo",
      "rating": "1",
      "title": "Turning off sound",
      "content": "Was there an update recently?  When I'm listening to Spotify and scrolling Facebook if I leave Facebook or lock my phone the music stops.  This seems to happen every time there's an update.  Get your stuff together Meta!",
      "date": "2025-10-02T16:39:35-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "HRJafael",
      "rating": "2",
      "title": "Audio issues with last app update affecting other apps",
      "content": "If I have music or any other audio playing from another app, it gets cut off if you open Facebook and then move to another app. I’ve tried turning off any auto play settings in Facebook but it seems like it’s a bug with the last app update.",
      "date": "2025-10-02T16:37:32-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Vincent Corbett",
      "rating": "5",
      "title": "Vincent Corbett",
      "content": "Great way to connect to brothers and sisters in Christ",
      "date": "2025-10-02T16:15:31-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Muff is. my. Nock Name .",
      "rating": "4",
      "title": "Take Care  of your Brain…. Before you loose it !!",
      "content": "This is excellent for the Brain to work !  Mine  need’s recouped  !  I was in an accident wreck in 1978…passenger - of course!  I ended up getting a busted Left eye socket & busted  jaw. The  driver died  instantly ! That’s all. I remember !!   Pretty sad… but I’m still alive !!  Hallaluah !!  Let’s Thank goodness for Life !!  \nI Love it !!",
      "date": "2025-10-02T16:11:45-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Aaron Steven",
      "rating": "5",
      "title": "Best social media than Instagram",
      "content": "Facebook is so good. I love Facebook. You can play games and watch videos on it. I love it. I will be on Facebook for the rest of my life. Thank you Facebook.",
      "date": "2025-10-02T15:58:08-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Anonymous Pe Erre",
      "rating": "1",
      "title": "Unnecessary Ad",
      "content": "A lot of unnecessary ad every two post o reel or video",
      "date": "2025-10-02T15:52:24-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "TCQ98",
      "rating": "1",
      "title": "Can’t swap accounts",
      "content": "I don’t want to connect my accounts to each other. I’m not using that account center garbage. Why did you remove the ability to fully log out?",
      "date": "2025-10-02T15:35:14-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "LauraLeesG",
      "rating": "1",
      "title": "Keep Community Chats",
      "content": "When you take away community chats, you take away the basis of what Facebook is all about building community. Many people in the groups that I belong to rely on those community chats for support and information that could be life-changing. Shame on you, Facebook.",
      "date": "2025-10-02T15:30:02-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Oasis admin",
      "rating": "1",
      "title": "The community standards",
      "content": "The community standards  post vetting process is unfair and doesn’t allow the community to defend themselves, the meaning or the intention behind the post.",
      "date": "2025-10-02T15:04:14-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "kmuhkg",
      "rating": "1",
      "title": "Most relevant comments are diabolical",
      "content": "The fact that I have to change to “All Comments” on every single post I come across makes interacting with people and pages much less appealing. Please for the love of god let us disable this feature permanently for every post and page.",
      "date": "2025-10-02T14:50:06-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "SlimHooper",
      "rating": "2",
      "title": "FaceBook Keeps & Stopping Music",
      "content": "Ever Since The Most Recent Update… Every Time I Open, Close, Switch Between Apps, & Even Locking My Phone As Well, FaceBook Keeps Stopping & Pausing My Music & I Feel Like SomeThing Needs To Be Done About That ASAP.",
      "date": "2025-10-02T14:48:23-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Keekee Shaliqui",
      "rating": "2",
      "title": "App now crashing other things",
      "content": "Since the latest IOS update, the facebook app now crashes both the podcast, music, and audible apps when they are also being used. Close the FB app, the others stop playing. Very annoying.",
      "date": "2025-10-02T14:36:42-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Mssazzi",
      "rating": "1",
      "title": "Hacked too many times to try Facebook again!",
      "content": "Four times since about 2007, I set up an account on Facebook and four times I was hacked. Someone else took over my account and I was helpless to do anything about it, nor could I get any help from Facebook. I lost so much when I lost those accounts - memories I can never retrieve anywhere else. And connections with old-time friends, and even some family have been permanently lost.",
      "date": "2025-10-02T14:07:05-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "AbS00102344",
      "rating": "1",
      "title": "Recent updates are full of bugs for old devices",
      "content": "lag in fCebook and mSsenger\nwhile page switching app crushes \napp loading slow \ntoday after updating most issues came . \nprofessional mode enables ids have bugs the most i think . please solve",
      "date": "2025-10-02T14:04:04-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Nisha2425",
      "rating": "5",
      "title": "Crear",
      "content": "Si good this app!!",
      "date": "2025-10-02T13:45:25-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "edward kadari",
      "rating": "3",
      "title": "Calls not audible while using FB",
      "content": "Hello team, since few days I noticed while using Facebook, any kind of calls are not audible even I connected to Bluetooth or CarPlay.",
      "date": "2025-10-02T13:44:57-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "LMK120561",
      "rating": "3",
      "title": "Things I don’t like.",
      "content": "Really hate video ads popping up within videos. I never finish the video I clicked on due to this. I do not mind the ads on FB, but there are getting to be too many. I wish I knew what comments are AI generated vs not or comments that people are clearly getting paid to write. Many groups have rules about commenting etiquette. I wish FB would do the same.",
      "date": "2025-10-02T13:37:09-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Mama Samiha",
      "rating": "5",
      "title": "Facebook is the best app of all of them .",
      "content": "Smart Facebook app,Is better than before",
      "date": "2025-10-02T13:35:28-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Surya’s BMW",
      "rating": "1",
      "title": "Mental issue",
      "content": "Facebook is good source of mental disease",
      "date": "2025-10-02T13:35:05-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Lexus James",
      "rating": "5",
      "title": "😍😍😍😍😍",
      "content": "😍😍😍😍😍",
      "date": "2025-10-02T13:25:36-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "lovergames17",
      "rating": "1",
      "title": "uodate",
      "content": "this update is ugly",
      "date": "2025-10-02T13:21:29-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Law103157",
      "rating": "1",
      "title": "Notifications count wonky",
      "content": "For some time now, the notifications count randomly displays seemingly random numbers at random times.  The only time it doesn't seem to display an actual valid number is when new notifications exist.",
      "date": "2025-10-02T13:21:22-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Bluedawn001",
      "rating": "5",
      "title": "Place is amazing!!!",
      "content": "Love the food here and service both are amazing!!! The serving size is awesome too make sure you are hungry and still plenty for lunch the next day.",
      "date": "2025-10-02T13:05:11-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "SatcomNerd",
      "rating": "1",
      "title": "As of 10/1 - update breaks audio",
      "content": "This latest update causes all audio to pause when minimizing the app.",
      "date": "2025-10-02T13:03:20-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "Jesus loves clayton",
      "rating": "2",
      "title": "They allowed me to be ripped off",
      "content": "They took and I had my Facebook hacked and they took all my pictures and everything in my identity and all the pictures of my husband I’ve been married to for 30 years and all my memories of him and everything and they allowed somebody else to own it now and didn’t go after them",
      "date": "2025-10-02T13:00:23-07:00",
      "version": "533.0.0",
      "appId": 284882215,
      "appName": "Facebook"
    },
    {
      "author": "kdsgbv",
      "rating": "1",
      "title": "Ws hate",
      "content": "Full of wgite sumpremacy and lies from maga",
      "date": "2025-10-02T19:09:20-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "joy jazzy",
      "rating": "5",
      "title": "To Elon musk",
      "content": "EVERY THING YOU INVENT IS fascinating and the people who criticize here are the ones that are so jealous of you and Real estate, can you be like you think like you have a brilliant mind like you your phone  are going to put apple  android and every other company out of Business GOOD  FOR YOU ELON and I hope you receive this message",
      "date": "2025-10-02T18:51:47-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "noly lo",
      "rating": "5",
      "title": "Excelente",
      "content": "Excelente",
      "date": "2025-10-02T18:46:45-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Sabrina gao 2025",
      "rating": "1",
      "title": "Suspend account without any reason and refuse to accept any explanation",
      "content": "To be honest. As 4 years user. And as 2 years premium user. Suddenly suspended my account hurt me so bad. I thought elon era will be better. Turns out it’s not",
      "date": "2025-10-02T18:42:33-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Wicked cometh",
      "rating": "1",
      "title": "Trash",
      "content": "This is nothing more than a gathering place for right wing, white trash, racist trying to anger anyone and everyone.  It’a just a reflection of the guy that bought it.",
      "date": "2025-10-02T17:10:46-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "MrDoug007",
      "rating": "5",
      "title": "Great work!",
      "content": "Mr Doug loves Twitter!",
      "date": "2025-10-02T17:00:34-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Qodngntkwsolz",
      "rating": "1",
      "title": "Gargle a fish, Elon",
      "content": "Screw this app and everyone on it. \n\n-someone who will continue using the app",
      "date": "2025-10-02T16:54:59-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "iamAndrestless",
      "rating": "1",
      "title": "Video opens links now",
      "content": "I don’t like the new update or clicking on the video automatically opens the link instead of a scrollable video with the link opening down below. I wish for it to go back to how it was.",
      "date": "2025-10-02T16:30:16-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Randoman5",
      "rating": "1",
      "title": "Weapon of Mass Disinformation",
      "content": "Musk has created the world’s most wretched den of scum and villainy. Twitter is the greatest source of ignorance in the world.  When human civilization end I have little doubt Twitter will have played a roll.",
      "date": "2025-10-02T16:25:57-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "djrobsd1",
      "rating": "1",
      "title": "Elons private playground",
      "content": "This is a political platform designed for you to be served propaganda by Elon Musk and the MAGA.",
      "date": "2025-10-02T15:22:03-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Xxpolloloco",
      "rating": "1",
      "title": "Racist App",
      "content": "I used to love this app, now it’s filled with racism and hate from everyone since it’s “freedom of speech”, would not recommend it to anyone.",
      "date": "2025-10-02T15:14:44-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "灰太狼815",
      "rating": "4",
      "title": "不懂就问",
      "content": "没有看懂，希望这个回复有一个及时翻译，或者可以复制内容。",
      "date": "2025-10-02T15:06:54-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "sierracatalina1",
      "rating": "1",
      "title": "bug city",
      "content": "everything is broken & nobody cares.",
      "date": "2025-10-02T14:35:38-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Cardithorac 1",
      "rating": "1",
      "title": "Twitter was better",
      "content": "most of the stuff i get on my feed is poorly curated and doesn’t fit my wants n likes like twitter did. you got something wrong somewhere!",
      "date": "2025-10-02T14:31:30-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Princedeborah",
      "rating": "5",
      "title": "Hope I do not get hacked on here",
      "content": "I hope to god I do not get hacked on here",
      "date": "2025-10-02T14:08:13-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "KJB627",
      "rating": "1",
      "title": "Lb",
      "content": "Absolute worst ownership and customer service ever. Do not patronize this business.",
      "date": "2025-10-02T13:34:49-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Boschulte",
      "rating": "5",
      "title": "Love you Elon",
      "content": "God Bless USA",
      "date": "2025-10-02T13:02:25-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "deliverydudes",
      "rating": "5",
      "title": "awesome",
      "content": "i love this app",
      "date": "2025-10-02T12:57:15-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "MC Solar Wind",
      "rating": "5",
      "title": "X is the news",
      "content": "Great place to consume and information and make your voice known on the topics in which you are familiar and passionate. You can find communities here that are engaging, thought-provoking and raw. Many times, the discussions happen on X first and then filter out to other sources.",
      "date": "2025-10-02T12:50:38-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Your bob jones",
      "rating": "5",
      "title": "Why I love this",
      "content": "This is the best app I ever have been on",
      "date": "2025-10-02T12:45:50-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "koki385",
      "rating": "1",
      "title": "Nothing loads",
      "content": "this app has problems loading anything",
      "date": "2025-10-02T12:43:43-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "ProfXLegacy",
      "rating": "5",
      "title": "Amazing",
      "content": "Best app over all I love it. Invested in it as well.",
      "date": "2025-10-02T11:57:39-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "LuckyLeopold",
      "rating": "5",
      "title": "X  is back !",
      "content": "Really can’t beat X for breaking news!",
      "date": "2025-10-02T11:41:11-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Reznov24",
      "rating": "5",
      "title": "Great App",
      "content": "My favorite App",
      "date": "2025-10-02T11:37:02-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "CyclicGMP",
      "rating": "1",
      "title": "Obscene",
      "content": "Way too vulgar trash talk by repuGnicans since the Muskrat bought it,",
      "date": "2025-10-02T10:52:18-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "aallyyssaa1",
      "rating": "5",
      "title": "Cool app",
      "content": "U should get it",
      "date": "2025-10-02T10:09:40-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "SaKhanh",
      "rating": "5",
      "title": "FREEDOM",
      "content": "THANK YOU ELON!!!",
      "date": "2025-10-02T09:54:46-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "mesugafritz",
      "rating": "5",
      "title": "America’s news channel",
      "content": "Elon Musk has through his generosity and love for America provided a free speech forum. Everyone have the right speak their mind, their beliefs and  \nthe right to disagree, respectfully. The keyword here is respectfully as that is what maintains  a civilized society. \n\nDue to these standards, X is now America’s news network. Compared to X, corporate news, networks, corporate media all of this is now just a joke.",
      "date": "2025-10-02T09:50:47-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Pinkywork",
      "rating": "5",
      "title": "Good Content",
      "content": ";…Relevant …!",
      "date": "2025-10-02T09:08:48-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "anaeman",
      "rating": "5",
      "title": "Only X",
      "content": "I love you",
      "date": "2025-10-02T08:44:49-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Pastel80",
      "rating": "5",
      "title": "Another Bluster",
      "content": "Not on this website very long a lot of gripes where is the facts who believes anyone in this political climate",
      "date": "2025-10-02T08:26:22-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "knowsumptin",
      "rating": "5",
      "title": "News for the Awake, not for the woke.",
      "content": "Thank you Mr. Musk.\nPlease consider doing some internal audits for those in X management engaged in the abridgement of free speech.\nAs a U.S. based platform this is a valued freedom for those users.\nBe the 21st century version of \"Radio Free E(urope)arth\".\nI know that's a lame name, but the intent is  something I believe that you're 100% on board for.\nThank you for your efforts, creativity, and dedication to freedom and merit.",
      "date": "2025-10-02T08:19:01-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Manchurian Cantaloupe",
      "rating": "1",
      "title": "Banned for 7 days for responding words of poster",
      "content": "I was banned for 7 days for repeating to the poster his own claims. He suggested that people use scientifically unproven/disproven treatments for Covid/flu. Since the poster had his medical license revoked, I suggested he sit out this discussion and try some of the “cures” he suggested. I was banned for being “violent”. If asking him to try his own “meds” is VIOLENT, then surely his recommending those same “meds” to unwitting readers is even more VIOLENT. Ban him for a week as well, to be fair.",
      "date": "2025-10-02T07:58:08-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Tfibb",
      "rating": "1",
      "title": "Distraction",
      "content": "This application takes your focus away from what is actually taking place on earth right now. Your mental Focus is a nuclear power. They want to control it. Wake up",
      "date": "2025-10-02T07:43:54-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "wuynnnnnnn",
      "rating": "2",
      "title": "Suspended for no reason",
      "content": "I’m getting so sick of social media. You allow racist to run rampant on here saying what they want but when I post jobs for people to apply to with the links it’s considered spam and my account gets suspended? How long will this suspension last? If I’m paying monthly to use this app there should be no reason my account is getting suspended. For posting good deals on jobs and apartments? I was posting on MY page not spamming anyone else’s comments or on their page with these job links. Yeah X is running its course.",
      "date": "2025-10-02T07:38:56-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "GovnCheese",
      "rating": "1",
      "title": "Literally turning into AI slop",
      "content": "Posts and comment sections are full of bots, posts are botted with likes and comments, some of the times the person paying for the bots to like, forget to buy comments and comment likes… engagement farming on this app couldn’t be any more pathetic than it already is.",
      "date": "2025-10-02T07:33:23-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Winter.Cee",
      "rating": "2",
      "title": "BUGGY!!!",
      "content": "everytime i open this app its always saying get started as if i haven’t had my account for over 5 years! its laggy, bugged, and starting to get annoying",
      "date": "2025-10-02T07:10:35-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "ihcc70",
      "rating": "4",
      "title": "Looking for the benefit of being verified?",
      "content": "What’s the benefit of being verified? I’m trying to understand this.",
      "date": "2025-10-02T07:06:32-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "#2Sib",
      "rating": "5",
      "title": "#1News source",
      "content": "X The only place you can see all sides of an issue and use your own discernment to determine what’s true.",
      "date": "2025-10-02T06:56:11-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Buris Hashira",
      "rating": "5",
      "title": "Fastest and Honest news",
      "content": "X is the most reliable, honest and trusted source of news: Politics, Entertainment, Community news, Faith, and daily news feed via personal vblog.",
      "date": "2025-10-02T06:47:23-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Alive yty",
      "rating": "5",
      "title": "Great",
      "content": "i respect",
      "date": "2025-10-02T06:28:14-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Gonzo ghiiy",
      "rating": "5",
      "title": "X is way better than Twitter",
      "content": "X is 1000 times better than Twitter",
      "date": "2025-10-02T06:24:52-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "fyomommaelon",
      "rating": "1",
      "title": "Joke app",
      "content": "90% bots",
      "date": "2025-10-02T05:45:59-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Jarousek76",
      "rating": "5",
      "title": "Best app for news",
      "content": "I have been using X for over 8 years and the last four years have been great! Elon thank you for saving the freedom of speech. If you want the information you need go to X.",
      "date": "2025-10-02T05:05:32-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Maximumlove.",
      "rating": "2",
      "title": "Mr. honesty",
      "content": "Your commercial there says they're not allowed to ask you all these questions and including your credit rating and what do you do on your application yes for a credit against what's up with that? Tell the truth",
      "date": "2025-10-02T03:42:04-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "T Money Mil",
      "rating": "1",
      "title": "Dangerous",
      "content": "It’s the devils playground. Not good for your mental health.",
      "date": "2025-10-02T03:33:46-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "DarlingJesus",
      "rating": "5",
      "title": "Some Videos are automatically opening website links",
      "content": "Please fix this for as as they’re very annoying u could see a video you really want to watch and you can’t watch it cus it opens a website link that’s not about the video at all \nPlease fix this 🙏🏾",
      "date": "2025-10-02T03:15:27-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Jimmyc2023",
      "rating": "3",
      "title": "More space",
      "content": "Should have more space to state a comment.",
      "date": "2025-10-02T02:23:03-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "Patriot4ever087",
      "rating": "1",
      "title": "VERY BIASED! Obvious Elon owns, it’s all PRO TRUMP",
      "content": "this is all right wing media. There’s not transparency when it comes to politics.",
      "date": "2025-10-02T00:53:07-07:00",
      "version": "11.27",
      "appId": 333903271,
      "appName": "X"
    },
    {
      "author": "ZoBeats",
      "rating": "5",
      "title": "Best app for wireless Apple Music control",
      "content": "What I said above",
      "date": "2025-09-23T21:07:49-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "nick8p9863",
      "rating": "5",
      "title": "Still works",
      "content": "I used to use this with iTunes. Tried to use it today with Apple Music on the latest app versions/macOS version… no luck, even following all the Home Sharing instructions on the Apple help page, until finally I closed Apple Music and re-opened it. Magically the option to connect finally appeared. The help docs could use an update.",
      "date": "2025-09-14T17:25:48-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "T3kSp3k",
      "rating": "3",
      "title": "Pretty mid",
      "content": "Could have other controls, but you get what you pay for, I guess.",
      "date": "2025-08-24T12:02:39-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Rsmagnaman",
      "rating": "1",
      "title": "Send to stereo iPod pair PLEASE",
      "content": "Remote only sees single iPods! Please fix!!!",
      "date": "2025-08-19T13:39:36-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "STAR2C",
      "rating": "5",
      "title": "No Issues",
      "content": "I have had no issues (not a one) with iTunes remote, been using it for decades. I only wish Apple would have pitch control like JRiver.",
      "date": "2025-08-19T07:54:30-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Thorn Plutonius",
      "rating": "4",
      "title": "Does not accurately work with playlists",
      "content": "I’ve been using this app for years.  After iTunes was renamed “Music”, this app stopped correctly displaying playlists.  My lists tend to be sorted by year, ascending.  When viewed from this app, they don’t sort as they are in the computer.  I infer this app is no longer being supported to keep up with changes in the Music APIs.  Sadness.  I will miss it when it inevitably ceases to interface with Music.  Would that there was a working, supported replacement.",
      "date": "2025-08-11T05:39:52-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "stulevine",
      "rating": "3",
      "title": "A good option for remote play on a Mac.",
      "content": "While this is a fairly decent option for controlling my headless Mac Mini M4 connected to an Audiophile DAC in my HiFi system,  it only shows the Library items (things I’ve added to my library).  It would be so much nicer to be able to play music from Apple Music or even search Apple Music so I can play content outside of just my Library.  Make Remote more like the Music app in that way.  And, perhaps the need for iTunes remote would be unnecessary if the iMac could behave like my HomePods and I could use AirPlay to have the iMac play content from it’s own library without having to use my iPhone to DAC AirPlay connection.",
      "date": "2025-07-29T07:46:57-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Darth_R3van",
      "rating": "1",
      "title": "Never works",
      "content": "Pathetic something that has been around since the 2000s and used to be flawless, hasn’t worked reliably for years",
      "date": "2025-07-25T17:46:40-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "stlasmith",
      "rating": "1",
      "title": "Would be nice if it worked",
      "content": "This app works 1 in 100 times. I can’t remember the last time I was able to control my Apple TV with this app. Nice concept though.",
      "date": "2025-07-24T23:43:45-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Databanktwo",
      "rating": "2",
      "title": "Constant Connection Issues",
      "content": "For as long as I’ve been using this app, whether it was with my computer and now my brand new iPhone 16e there’s been nothing but connection issues. Most of the time I have to restart the app before I even use it in hopes of it connecting.There are other issues of which I can’t be certain if it’s the app itself, the phone, or the computer, but many I do know have to do with the HomePod, which is a disaster of a device. Essentially, I have discovered that all that the HomePod is useful for is acting as a timer and to tell me what the weather is. Outside of that it’s a mess. I don’t know that 10 to 15 years, but it is in no way like it was before where the old saying was Apple, it just works. Now it’s Apple, nothing works.",
      "date": "2025-07-17T07:48:08-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "RafaFerrer",
      "rating": "5",
      "title": "👍",
      "content": "👍great",
      "date": "2025-07-06T20:44:04-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Coffee Conspiracy",
      "rating": "1",
      "title": "needs options",
      "content": "No icon for iTunes remote on phone screen separate to access. needs option  to add music to playlist, library!",
      "date": "2025-07-04T10:39:16-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Math11235",
      "rating": "5",
      "title": "Must have",
      "content": "Essential iOS system utility.  Need it to seamlessly integrate with all OS's in the Apple ecosystem.  Recommend a dedicated device 📻 + macOS 💻 if you airplay.  Usability with watchOS  ⌚️and HomePod Software (esp. stereo config) 🫛🫛are disappointing 😢 to say the least.  Hoping Apple resurrects the watchOS app. 🤞🤞🙏🥺",
      "date": "2025-06-25T17:15:59-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "222momo222!",
      "rating": "5",
      "title": "Android",
      "content": "Please make a version for Android phones.",
      "date": "2025-06-15T14:22:09-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Verve747",
      "rating": "2",
      "title": "Update?",
      "content": "This works ok but really needs to be updated to run with current OS’s!",
      "date": "2025-05-31T09:01:54-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "No Apple Pay, no pay.",
      "rating": "1",
      "title": "Dark Icon ☹️",
      "content": "iOS 18 has been released for almost a year, and this Apple-made app still does not support dark icon.",
      "date": "2025-05-24T04:58:16-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "ivegotnoclue",
      "rating": "1",
      "title": "Doesn’t work at all any more.",
      "content": "Apple dropped support for this app with newer macOS systems. Absolutely does not work with sequoia.",
      "date": "2025-04-23T17:48:32-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "elliotsmoon",
      "rating": "5",
      "title": "Great App",
      "content": "they should really update this with the new UI, this app does everything I need with how my media library’s set up. Glad it’s still around",
      "date": "2025-04-23T15:50:57-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Trula Marie",
      "rating": "1",
      "title": "Used to Love This App",
      "content": "Like the title says I used to love this app and it does still work with Music on newer builds but it no longer works on Apple TV on the MacBooks and hasn’t for quite some time.  I have also yet to find an alternative.",
      "date": "2025-04-23T05:18:40-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "David Moon-Wainwright",
      "rating": "2",
      "title": "Great, but…",
      "content": "Wonderful app, but using with an older MacMini that can’t go beyond 10.13.6, it will not control any Apple Music content. A remote should be software agnostic, but clearly Apple wants to push us to new hardware and software and refuses to give even basic control.",
      "date": "2025-04-03T16:20:31-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "mlohr",
      "rating": "3",
      "title": "Mediocre",
      "content": "Can be difficult to set up the first time, with no explanation for failures. Does not maintain connection while playing, so there is always a delay when opening the app to address a song. Does not appear on the lock screen or upper right hand corner of the remote device while playing music on the host.",
      "date": "2025-03-28T08:58:29-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "DeafMatt",
      "rating": "5",
      "title": "Sweet!",
      "content": "I can control music with my phone!",
      "date": "2025-03-24T22:53:20-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "punta-123",
      "rating": "5",
      "title": "El mejor control remoto Watch",
      "content": "me gusta  gracias Apple",
      "date": "2025-03-23T15:49:29-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "1note",
      "rating": "2",
      "title": "barely useful",
      "content": "barely",
      "date": "2025-03-22T15:09:20-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Mike L - BH",
      "rating": "4",
      "title": "One More Feature, Please",
      "content": "Bulletproof and does exactly what you want - except for one thing.  It doesn’t have a stop button. The whole point of a remote is to be able to control remotely.  You can pause, but you can’t stop. If you’re using it as part of a home music system, particularly if as I do with a dedicated Mac Mini, it lessens its functionality. Five stars otherwise.",
      "date": "2025-03-20T07:28:38-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Innoculis",
      "rating": "1",
      "title": "Does not work",
      "content": "Does not work with Apple Music on Windows. Highly disappointed.",
      "date": "2025-03-13T09:51:43-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Chewyid",
      "rating": "5",
      "title": "Need these features in new Apple TV remote app",
      "content": "This is one of my favorite actual Apple apps. Rumor has it. It was written by some developers independently of the Apple TV development process. I don’t know if it is true, but it is a very Apple like story.\n\nThere are so many features within this app that were neglected from the new Apple TV and to this day still not have been introduced to the new Apple TV or its companion app on iOS Devices. \n\nApple really should include these features like quickly jumping into the library for the new Apple TV.",
      "date": "2025-03-02T14:29:53-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Princejron",
      "rating": "1",
      "title": "Bring back watch support!! In iOS 18",
      "content": "Gave 2 stars, because App is no longer visible to use after upgrading the iOS 18 version! This app was how I could control music remotely from computer! Now it’s no longer on the watch. Please bring back!",
      "date": "2025-03-02T08:55:53-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Bean_Brat1",
      "rating": "5",
      "title": "App Review",
      "content": "I like using it when I am lazy and don’t want to sign into my mac everytime and i can control my music from my phone",
      "date": "2025-03-02T06:54:50-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "RSK_1600",
      "rating": "4",
      "title": "Excellent app. Please continue support and potentially implement live activity.",
      "content": "This app is excellent, and is robustly made, considering the last update was 5 years ago. Please consider adding a live activity to the app that would allow for a similar view as playing media. Even a shortcut cut for the notch bar previews when in use would be a great improvement. Please attempt to implement this in some form.",
      "date": "2025-03-01T06:52:51-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Control of iPad playback",
      "rating": "3",
      "title": "Needs support to control playback from iPad or iPhone",
      "content": "Needs support to control playback from music playing from iPad and/or iPhone. If playing from an iPad, you cannot connect the Remote (say from an iPhone) to control the playback from the iPad. Very frustrating.\nOtherwise works great!",
      "date": "2025-02-27T12:11:24-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "tenoche mazapan",
      "rating": "4",
      "title": "Great but Sometimes Gets Confused",
      "content": "This works really nicely. It’s great to listen to the music all over the house and outdoors via airplay or HEOS. \nJust sometimes it seems gets confused and either doesn’t respond at all and you have to go to the computer and use the keyboard to press play… after that it is back to working.",
      "date": "2025-02-25T20:39:23-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Tyler324ts",
      "rating": "5",
      "title": "A Winner for those not in the cloud",
      "content": "It’s wonderful having access to my full music library on my Mac anywhere in my house.  It’s unfortunate that Apple has made Home Library in the Music app barely usable — but the Remote app fills in well by letting me airplay to any device in my home.",
      "date": "2025-02-24T08:22:45-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Jus7inlane",
      "rating": "5",
      "title": "Worked immediately so far",
      "content": "Barely even downloaded and the thing picked up my music instantly",
      "date": "2025-02-06T11:39:32-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Amelia Renee Frederick",
      "rating": "1",
      "title": "Horrible App",
      "content": "This is the worst experience I’ve had with an Apple app ever. This is an absolute joke. Whoever was working on this app needs to be put in front of a firing squad.",
      "date": "2025-02-02T08:23:15-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "pms13131",
      "rating": "5",
      "title": "Remote pms13131",
      "content": "Musical control of multiple amps at my fingertips…\nKinda makes the digital sound more palatable 🎶\n\nI’m an AnalogMan…",
      "date": "2025-01-13T10:32:57-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Comic19999999",
      "rating": "2",
      "title": "Apple Watch App",
      "content": "This used to work as an Apple Watch App. Not sure why Apple took it away. Please bring the remote app back to the Watch version a long with the iPhone version.",
      "date": "2025-01-08T12:43:41-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Julien Tregoat",
      "rating": "4",
      "title": "reliable",
      "content": "would love if you could add \ntracks to a playlist, and delete tracks from the library if you’re the owner",
      "date": "2025-01-03T18:31:03-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "jmco",
      "rating": "4",
      "title": "I wish Apple would update it",
      "content": "Don’t muck it up by making it AirPlay 2 lossy but, give its organizing ability a bit more update to be like Music app. Dark mode, etc. Just friggin update the UX and UI!",
      "date": "2024-12-30T12:42:07-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "888stev333",
      "rating": "2",
      "title": "Doesn’t connect automatically",
      "content": "Nice app but it fails to connect unless I either have the app open when opening iTunes or turn off/on home sharing. It should be smart enough to connect as long as iTunes is open.",
      "date": "2024-12-28T08:03:43-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "MacBandit",
      "rating": "1",
      "title": "Was useful",
      "content": "Was a great app but hasn’t been updated to work with the current OS.",
      "date": "2024-12-25T11:32:19-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "cloutster",
      "rating": "5",
      "title": "can you update this please",
      "content": "just a facelift this app would be better if lock screen control was a thing as well man what do i know im just some random",
      "date": "2024-12-25T11:17:33-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Bale of",
      "rating": "5",
      "title": "Works fantastic",
      "content": "Apple, please keep updating this. This is a simple but extremely useful app! It just works.",
      "date": "2024-12-23T20:10:50-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "DrMa-buse",
      "rating": "5",
      "title": "Awesome",
      "content": "Would be even better if it was also available as a widget…",
      "date": "2024-12-21T18:10:56-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "dschauer12",
      "rating": "2",
      "title": "Needs a widget",
      "content": "A Lock Screen widget would be so convenient. It would also be nice if the connection to my desktop didn’t commonly dropout at random.",
      "date": "2024-12-20T15:55:28-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "JoshuaIVargas",
      "rating": "1",
      "title": "No support for windows apple music app",
      "content": "title",
      "date": "2024-12-16T09:22:41-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "XweAponX",
      "rating": "3",
      "title": "This used to work great",
      "content": "But, I can’t seem to get this app to detect any of my iTunes libraries, which I still have running on my systems and on my Apple TV. It is just not finding anything and I am logged in with the same Apple ID on every machine. I have no idea where to go to ask for help.",
      "date": "2024-12-11T21:19:51-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "DJ Code",
      "rating": "1",
      "title": "Missing apple watch mac control",
      "content": "This app was great til the apple watch version got removed in favor of just appleTV control and removed all ability to control any iTunes or apple music instance on a mac or pc.  Big miss on apple for removing this function…",
      "date": "2024-12-09T15:19:31-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "sirdjo",
      "rating": "5",
      "title": "Remote app",
      "content": "Best app ever it wasn’t working for a while I missed it",
      "date": "2024-12-08T14:43:14-07:00",
      "version": "4.5.1",
      "appId": 284417350,
      "appName": "iTunes Remote"
    },
    {
      "author": "Dedgee",
      "rating": "4",
      "title": "WhatsApp",
      "content": "Messenger",
      "date": "2025-10-02T20:11:38-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "M. Dev.",
      "rating": "5",
      "title": "Easy and Convenient",
      "content": "Especially for international or wify calling. I’d like to hear more about the privacy features constantly advertised making this app secure. In a digital age this is no different from what you might be using for a smartphone.",
      "date": "2025-10-02T19:44:34-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "AColchamiro",
      "rating": "5",
      "title": "Perfect",
      "content": "I’ve been using ‎WhatsApp for years and it is just amazing",
      "date": "2025-10-02T19:40:00-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Jajaja 😹 que 😨",
      "rating": "5",
      "title": "Muy bueno",
      "content": "👍👍👍👍👍👍",
      "date": "2025-10-02T19:25:26-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Irisyei",
      "rating": "5",
      "title": "Wathsapp",
      "content": "Ayuda por favor 📣📣 no puedo acceder a los stickers destacados o favoritos , ya he hecho de todo hasta borré la app y la volví a instalar he entrado en configuración y he verificado todo pero es imposible acceder , cuando tocó el icono de los destacados la pantalla se frisa y tengo que cerrar la app y volverla a abrir para poder usarla , ayúdenme por fabor",
      "date": "2025-10-02T19:12:15-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chicken949",
      "rating": "1",
      "title": "No sirve",
      "content": "No deja salir de la conversación cuando uno está en una llamada es una actualización tan estupida!",
      "date": "2025-10-02T18:39:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Ricch LIFFE12",
      "rating": "1",
      "title": "Problem we are  facing",
      "content": "Now WhatsApp is no more WhatsApp when you post a pic you’ve taken or a video , it then turns to be blur , you doesn’t get the original one . Kindly work on it . Thank you",
      "date": "2025-10-02T18:25:48-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Fractional/2",
      "rating": "1",
      "title": "Frustrated",
      "content": "There is nothing more frustrating than trying to transfer chats from Android to iPhone. If you don’t want to do it when you set up the phone you have 0 means to transfer them later unless you want to pay yearly subscription for a third party app that you’re going to use only once. It’s 2025, it’s easier and faster and cheaper if not free to generate unbelievable AI videos that to be able to merely continue an WhatsApp conversation where you left it earlier.",
      "date": "2025-10-02T18:16:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Kyle.Kelly589",
      "rating": "5",
      "title": "Wow",
      "content": "Cool",
      "date": "2025-10-02T16:53:45-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Illupo1979",
      "rating": "1",
      "title": "Una basura la nueva actualización",
      "content": "La Nueva actualización una ando en moto y cualquier vibracion activa un mensaje de error y se cortan las notas de viz",
      "date": "2025-10-02T16:26:52-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Fafafafafafafafafafaf",
      "rating": "1",
      "title": "it  is  so. BAD",
      "content": "I got expose like actually",
      "date": "2025-10-02T15:39:12-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Juansebz",
      "rating": "1",
      "title": "Lost my chats conversations",
      "content": "Horrible service for not being able to recover my chats conversations.",
      "date": "2025-10-02T15:36:12-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Boris James Fischer",
      "rating": "5",
      "title": "Good company",
      "content": "They are very reliable, knowledgeable, and patient.",
      "date": "2025-10-02T15:00:21-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Bel Fanm Creole",
      "rating": "2",
      "title": "Rate",
      "content": "My previous message would not back up to my new phone",
      "date": "2025-10-02T14:44:03-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chuchu1373",
      "rating": "5",
      "title": "Esta última actualización estoy teniendo problemas con mí whuasat",
      "content": "No me funciona bien whuasat",
      "date": "2025-10-02T14:44:02-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "אדל קקון",
      "rating": "5",
      "title": "שלום",
      "content": "אפליקציה טובה",
      "date": "2025-10-02T13:18:11-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Yetunde111",
      "rating": "1",
      "title": "URGENT: REQUEST FOR REVIEW AND RESTORATION OF BLOCKED ACCOUNT",
      "content": "Dear WhatsApp Support,\n\nI hope this message finds you well. I am writing to urgently request a review and restoration of my WhatsApp account [your phone number]. My account has been repeatedly blocked despite not engaging in any activity that violates WhatsApp’s policies.\n\nOver the past few days, my account was blocked multiple times, and each time I submitted a review, it was restored temporarily, only to be blocked again without any clear explanation. I am confident that I am not engaging in any spammy or policy-violating behavior.\n\nI kindly request a thorough review of my account activity. I rely on WhatsApp for business communication and personal connections, and I am committed to complying with all policies.\n\nPlease let me know if there is any additional information I can provide to resolve this issue promptly.\n\nThank you for your attention and assistance.",
      "date": "2025-10-02T12:52:13-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "JGEJMZ",
      "rating": "5",
      "title": "Finalmente puedo tener WhatsApp en mi iPad",
      "content": "Ya tenía muchos años esperando que tuvieran una aplicación para el iPad,  normalmente usaba el web pero ahora siento que es más fluido.",
      "date": "2025-10-02T11:47:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "nhs503",
      "rating": "4",
      "title": "great app but needs better iOS/Android migration",
      "content": "Countless Reddit threads people struggling to move from iOS to android or android to iOS. Multiple arcane phone resetting procedures later it still doesn’t work well. There should be a simple export and import to cloud for message history, and the application should be able to translate between formats.",
      "date": "2025-10-02T11:13:13-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Stmple",
      "rating": "5",
      "title": "Excelente aplicación",
      "content": "Lo más usado",
      "date": "2025-10-02T10:56:10-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "AxelMTF",
      "rating": "5",
      "title": "Hola",
      "content": "Solo quería preguntar algo mi  no actualiza a la versión 15.1 ya entonces no puedo utilizar WhastApp no entiendo eso porfavor",
      "date": "2025-10-02T10:53:31-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "𝐃𝐚 𝐤𝐢𝐳𝐚✞",
      "rating": "5",
      "title": "Kiza olifa",
      "content": "Kiza olifa",
      "date": "2025-10-02T10:16:57-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "asertivo del football",
      "rating": "4",
      "title": "Toyota Fortuner 2024",
      "content": "En existencia actualmente?\nCuantos kms",
      "date": "2025-10-02T09:38:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Amir wehbe",
      "rating": "5",
      "title": "Good",
      "content": "So so so good",
      "date": "2025-10-02T08:46:48-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "ĶÏÑĠ Perry bwoy",
      "rating": "1",
      "title": "T",
      "content": "Messages run slow",
      "date": "2025-10-02T08:35:33-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Barbiegirl2711",
      "rating": "3",
      "title": "Regular",
      "content": "La app me gusta pero estoy harta de que el desordene los estados no los puedo ver en orden es desquiciante el reguero que forman y odio más aún no poder seguir ningún canal porque si lo sigo me riega aún más la bandeja",
      "date": "2025-10-02T08:29:18-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "pandora 247",
      "rating": "1",
      "title": "35 scam calls a day from WhatsApp selling number",
      "content": "Update had to download to new phone went from 1 spam call a day to 50 with in the same day I downloaded and set up the app… scam app \n\nDon’t download. It’s free cause they sell you phone number. I get 35 spam calls a day. Never got any until I downloaded this junk app. I don’t even take my phone off mute anymore cause it’s non stop spam calls. Company should be shut down for causing harassment.",
      "date": "2025-10-02T08:23:08-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Bri9988",
      "rating": "5",
      "title": "B",
      "content": "I talk to my best friend now",
      "date": "2025-10-02T07:35:03-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Jeragomez",
      "rating": "1",
      "title": "Horrible",
      "content": "Cuando van arreglar la nueva actualización? Maoísmo se me sube la ventana de sticker hasta arriba y no se puede bajar solo cerrando la app. Los mensajes se suben solos en el chat, que horrible",
      "date": "2025-10-02T06:56:34-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Chess0304",
      "rating": "1",
      "title": "Banned after first message ever lol",
      "content": "Installed for first time in my life via a business contact link to ask a question to a business.  Within 1 minute of sending my first and only message on this app in my life I was banned and having to appeal.  Too funny, I’ll go back to not using it I guess.",
      "date": "2025-10-02T06:18:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "hecrossi",
      "rating": "5",
      "title": "Genial",
      "content": "Las posibilidades de comunicarse a cualquier parte del mundo con esta calidad a cambiado profundamente a la sociedad humana. Y aunque algunos lo utilicen para hacer daño confío en que la gran mayoría lo utilicen para mejor la sociedad cosa que parece difícil a la luz de tantos conflictos. No aflojen en su determinación de mejorar la comunicación . Felicitaciones",
      "date": "2025-10-02T06:17:35-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Rommyraphael",
      "rating": "1",
      "title": "Banyak Bug",
      "content": "Semenjak update versi 25.25.73 banyak sekali bug, dan yang paling parah adalah :\n\n1. Proses searching sangat lambat.\n\n2. Kalau saya menggunakan tanda • untuk setiap paragraf dan menekan enter untuk pindah paragraf maka muncul 2 titik paragraf baru yang seharusnya di versi sebelumnya hanya keluar 1 titik paragraf baru.\n\nBug2 ini sangat mengganggu tolong secepatnya diperbaiki admin…🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
      "date": "2025-10-02T05:51:10-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "no tengo apodos soy maria",
      "rating": "5",
      "title": "Mis llamadas",
      "content": "Siempre me he comunicado muy bien , gracias a Ud",
      "date": "2025-10-02T04:27:47-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "APTomas",
      "rating": "4",
      "title": "Mala actualización",
      "content": "Ahora solo puedo subir videos de 38 segundos a mis Estados, antes era de 1:30 minutos! No entiendo por qué",
      "date": "2025-10-02T04:01:18-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "PaulZadeh",
      "rating": "5",
      "title": "WhatsApp Is not enough secure and agile",
      "content": "As a phD in AI, I do believe WhatsApp is not the best messaging app on the market and not secure at all. So fragile",
      "date": "2025-10-02T03:09:16-07:00",
      "version": "25.27.72",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "uhuegbu",
      "rating": "3",
      "title": "Schedule message",
      "content": "Just like you have created schedule calling, I think schedule messaging would be appreciated? Thank you so much",
      "date": "2025-10-02T02:30:57-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "giorgi.tsu",
      "rating": "1",
      "title": "Android and iOS incompatibility",
      "content": "The reason I am giving one star is that it’s a mess and huge pain to move chats and backups from android to iPhone and vice Versa. This is the reason I gave up using WhatsApp and moved to Telegram. When I wanted to move my backup from Google to IPhone there is no way to download backup from Google and then restore on iPhone. Also there is no way to sign in Google on IPhone either to restore WhatsApp backup from Google that was created from Android. similar isssue exists when you want to move from iPhone backup to Android WhatsApp. There is an app Move to iOS on Android but that works only on Factory Reset and then you cannot recover iPhone from iCloud. So basically when you are using WhatsApp you must be  either in iPhone or Android and for this reason I moved to Telegram.",
      "date": "2025-10-02T01:54:02-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "112494pd47",
      "rating": "5",
      "title": "Great app",
      "content": "Works great",
      "date": "2025-10-02T01:31:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Gatorade13579",
      "rating": "1",
      "title": "not receiving any notifications when my phone is off",
      "content": "i don’t receive text notifications unless my phone is on and unlocked. otherwise they go unnoticed. fix this you tech nerds asap",
      "date": "2025-10-01T22:09:19-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Santagto",
      "rating": "5",
      "title": "Sunrise in Santorini",
      "content": "Great",
      "date": "2025-10-01T21:27:29-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "sunilsardar07",
      "rating": "5",
      "title": "Sunil Sardar",
      "content": "Great communication tool for all generations. Thanks WhatsApp.",
      "date": "2025-10-01T21:06:06-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Emily niño",
      "rating": "5",
      "title": "Barbie Niño",
      "content": "Muy bueno en mi IPhone si trabaja :).. me encanta mucho es una aplicación muy buena.. 😘😘",
      "date": "2025-10-01T20:52:39-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "J - F - T - M",
      "rating": "5",
      "title": "Final para michuuu",
      "content": "Trizte final nosotros termina planeta mutituddd ze ba vuena termino Wasapthtpthhh",
      "date": "2025-10-01T20:04:09-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "wacowa",
      "rating": "5",
      "title": "Error",
      "content": "My WhatsApp keep telling me “unable to initiate call”",
      "date": "2025-10-01T19:46:54-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "MBNala",
      "rating": "1",
      "title": "Stickers icon",
      "content": "I click on Stickers icon and my WhatsApp freezes.",
      "date": "2025-10-01T19:16:32-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "↘️⬇️⤵️✖️❌💯",
      "rating": "2",
      "title": "Stupid app ever",
      "content": "Review kill every one of you there….how can you take down the account I have been using for over 6 to 7 years just because of a report made Accidentally…. The owner of this app is a fool and a loser….",
      "date": "2025-10-01T19:02:43-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Zatch’Mo",
      "rating": "5",
      "title": "Service",
      "content": "Easy to use. Very reliable",
      "date": "2025-10-01T18:22:46-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "NaiveCrow",
      "rating": "1",
      "title": "Terrible user experience",
      "content": "I cant still believe this app is as buggy as it is on iOS 17.7. App gets freezed when trying to view/download photos from groups, something that I have never ever seen happening in neither Android or Windows Phone.\n\nMaybe reduce the tracking and keep things simple, Meta :), otherwise might as well just cut communication through this platform like I did with FB on 2020\n\nSept 2025 update: on top of those bugs, AI is now forced upon us with no disable option :)",
      "date": "2025-10-01T17:51:44-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "??….????",
      "rating": "1",
      "title": "it’s broken",
      "content": "so i got whatsapp so i can facetime my friends that have samsungs and stuff reminder im 13+ and i put my birthday with my phone number and i chat my 3 friends “hi” each one of them and all of the sudden i get like banned or something and i cant use whatsapp for 24 hours and i had to like check my age or something? this doesnt make any sense fix it.",
      "date": "2025-10-01T17:29:04-07:00",
      "version": "25.27.73",
      "appId": 310633997,
      "appName": "WhatsApp Messenger"
    },
    {
      "author": "Mrhiej",
      "rating": "1",
      "title": "Unfairly banning users",
      "content": "Currently there is a large class action lawsuit and over 40k on a petition. People are getting falsely banned for horrible accusations!",
      "date": "2025-10-02T20:15:17-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "WUNTER..68$39",
      "rating": "1",
      "title": "🤦🏽‍♀️",
      "content": "This app needs to be fixed it is worried about the wrong things, and people they're suspending/deleting the wrong peoples accounts, they are focused on how many times a person you follow has changed their username,and marks them as a potential scam, and when you ignpre it too many times they will eventually suspend/delete your account, and appealing it doesn't get your account back, and after it suspends one of your accounts and you try to make another with the same number it suspends that one too, everyone please don't download this app.",
      "date": "2025-10-02T20:13:17-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Stop banning m3",
      "rating": "1",
      "title": "Instagram",
      "content": "They have suspended my account for no reason and I can't get it back",
      "date": "2025-10-02T20:08:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "gavlanierf05",
      "rating": "1",
      "title": "Incredibly buggy",
      "content": "I was wrongfully permanently banned. After looking online, it appears that this is a huge issue affecting other people as well. Instagram has taken no steps to correct this issue.",
      "date": "2025-10-02T20:06:10-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Imperial nate",
      "rating": "1",
      "title": "Why is my account compromised?",
      "content": "I can’t use this app anymore because my account got compromised for what \nplease fix this",
      "date": "2025-10-02T20:04:28-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "javierrres123",
      "rating": "1",
      "title": "It keeps restricting my account for no reason",
      "content": "I didn’t do nothing wrong I just use it to text ppl or see vids and I keep getting my account restricted for no reason I just got a new phone nd new number and i was making an account and once’s I made it and automatically restricted its annoying that it keeps doing that for no reason.",
      "date": "2025-10-02T20:02:09-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Smhinsta",
      "rating": "1",
      "title": "Delete the repost",
      "content": "Why am I accidentally clicking repost? Because you decided to put repost on where people scroll. Move it or delete it",
      "date": "2025-10-02T19:54:34-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "TETE_33",
      "rating": "5",
      "title": "Getting banned/suspended for no reason",
      "content": "I had sent my friend a reel like I usually do. My friend wasn’t able to see the video it had said “unavailable” there was nothing wrong with the reel i had sent her. It was just a funny relatable reel. When i tired sending it to her again it had said my account was being suspended. I didn’t understand because haven’t done anything wrong. Then it had asked me to take a video of myself to confirm its a real person. I had created another acc did the something. This is just very unexpected able. INSTAGRAM needs to FIXS this issue and STOP banning/ suspending peoples accounts for no REASON!.",
      "date": "2025-10-02T19:54:28-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "MRLWS1",
      "rating": "5",
      "title": "Great App",
      "content": "Instagram is a great app!",
      "date": "2025-10-02T19:54:19-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Deneiyah",
      "rating": "5",
      "title": "Posting",
      "content": "Thanks for the great activitys and things we can do on instagram but may please add a little more things thank you 🙂",
      "date": "2025-10-02T19:48:03-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "gillianjewelle03",
      "rating": "3",
      "title": "Invite collaborators",
      "content": "If I invite a collaborator to a post, once they accept, they should have the option to repost it/share it to their facebook. Especially on and between business accounts. You can have an approval question asking the original poster if the collaborator can share to other socials like threads and facebook!!",
      "date": "2025-10-02T19:41:01-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Ai_liltop",
      "rating": "5",
      "title": "My login",
      "content": "So I tried logging in my account and even tried facebook my username is ai_lostsoul21 and every time I tried to change change the password to get it back it will say password incorrect like if I was trying to login in so I restarted the app a couple times and turned off my phone and it’s just the same thing over and over if there’s anyway y’all can help me login that will be great and I love the app (don’t tell TikTok but it’s better than it) thank you",
      "date": "2025-10-02T19:40:35-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Yiyi 1995",
      "rating": "5",
      "title": "Me encanta instagram",
      "content": "Genial",
      "date": "2025-10-02T19:29:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "INCREDIBLE TECH!",
      "rating": "5",
      "title": "Classy and fun all at the same time!!",
      "content": "I am not a gamer but I am after playing at Ava’s wine bar! A lot of fun and money!",
      "date": "2025-10-02T19:28:02-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Darius926",
      "rating": "1",
      "title": "Darius Moreno",
      "content": "Instagram is stupid. Don't know why I got banned.",
      "date": "2025-10-02T19:28:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Bluestudio3783",
      "rating": "5",
      "title": "Love sharing my lifestyle! Thank you!!",
      "content": "Easiest way to share my lifestyle!",
      "date": "2025-10-02T19:24:37-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "raaachelmaine",
      "rating": "1",
      "title": "ENOUGH WITH THE ADS",
      "content": "Why are there 50000 ads in between every single story???!!!!!! ENOUGH",
      "date": "2025-10-02T19:21:31-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Eazye balla",
      "rating": "3",
      "title": "Do better",
      "content": "They took my account down for no reason at all and I couldn’t even get it back they justi taking people accounts to be honest if we can’t get our accounts we might as well go back to Snapchat y’all they playing around I made over 7 accounts some I can’t log in some get deleted and I don’t anything TikTok is better than instagram now",
      "date": "2025-10-02T19:13:01-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "choey545",
      "rating": "4",
      "title": "Evil, on purpose",
      "content": "Waste, fraud, and abuse!!!\nAnyone offering Medicare insurance knows this line!!!\nWaste is when you cut benefits for those less fortunate than you and build a 200million dollar ball room next to the White House!!!\nFraud is when you do something that will benefit you and probably only you, you know it’s wrong, but you do it anyway!!!\nAbuse is when you absolutely ruin someone, or a bunch of someones, just because you can!!! “Because you’re rich, they let you”!!! But you notice, in every scenario, someone suffers! What is it with you Repuglicans! Why do you need someone to suffer for you to do well!!! I’ll leave you with this!\nYour anger and hatred is directed at the wrong people! \nI don’t have your money! But I Know who does!!! And they need a reason to pass it around!!!\nDon’t wait for the government!\nYou can do it!!! Have a contest!\nSee who can help the neediest people in America and change their lives!! Wal-mart, you start!!!\nTake2% of your gross last year and pass it back to your employees! The employee working for you who makes the least gets the largest bonus and it lessens as it goes up the organization til the CEO gets one penny! Taxing it!!!\nFor the company, complete deduction!!! For the people, taxed at 2%! Watch this economy take off!!! And keep doing it!! Share your business with your employees!!! It will pay off in more ways than you know!!! And one more thing!\nNo more!\nWASTE,FRAUD,and ABUSE!!!",
      "date": "2025-10-02T18:58:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Angie win .",
      "rating": "3",
      "title": "insta suspension .",
      "content": "i had insta for like a few years since i was 13 , and im 19 now . & my account got suspended and disabled , and i been trying to make new accounts after new ones & it still gets me a warning as suspension . i make a new acc and change a new email or gmail still doesn’t work . & it happens to most people not just only me . other than that please fix my ACCOUNT .. Instagram or META AI . thanks !",
      "date": "2025-10-02T18:56:06-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "ironsipder7",
      "rating": "5",
      "title": "I like reels",
      "content": "I love to doomscroll and see femboys on my feed 24/7, keep up the good work femboy posters",
      "date": "2025-10-02T18:48:37-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "geoluv",
      "rating": "1",
      "title": "Only want you to watch reels so they can blast you with ads",
      "content": "You can no longer tap a commenter’s name to go to their page to check out their wall posts.  You tap their name and nothing happens, all you can do is tap their avatar which takes you to their stories.  Instagram is doing this because every second you spend on scrolling stories/reels or scrolling your feed lets them blast you with ads and every second you spend checking out other users accounts and looking at wall posts is lost ad revenue for meta.  The whole point of “social media” is to make social connection with other people.  Meta is destroying the social connectivity aspect of Instagram in order to keep you doomscrolling so they can blast ads at you.  This is a very up front and obvious example of how tech companies are actually devolving social media into a perverse profit-above-all-else social experiment.",
      "date": "2025-10-02T18:29:00-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "emoni r",
      "rating": "3",
      "title": "..",
      "content": "im ngl , yal b suspending peole for no reason onnis app but hey , its a coo app",
      "date": "2025-10-02T18:22:52-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Briaaa💞",
      "rating": "1",
      "title": "Logging into my account",
      "content": "I keep trying to log into my account, but when I try to log into my account, it goes to another screen and it says “ enter password” but when I enter my password, it says that it is wrong. I emailed you guys and I am waiting for you guys to email me back. Please fix this. I’ve been trying to do this since yesterday. I am tired. This is the only app I can communicate people on, and I cannot log into my account changed the password multiple times and I cannot log please respond to this and help me login to my account. Please and thank you.",
      "date": "2025-10-02T18:12:18-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Prettyface_.diamond_",
      "rating": "1",
      "title": ".",
      "content": "They keep banning my account for nothing so you should not get this app if u want that",
      "date": "2025-10-02T18:00:58-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Flyfisherz3",
      "rating": "1",
      "title": "EASY TO HACK",
      "content": "no way to stop hackers",
      "date": "2025-10-02T17:59:27-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Chichi6678",
      "rating": "1",
      "title": "Can’t scroll down my feed",
      "content": "Ever since the new iPhone update I get the “try again” error message when trying to scroll down my feed",
      "date": "2025-10-02T17:53:55-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Asianotas1an",
      "rating": "1",
      "title": "Why",
      "content": "I woke up to my account suspended saying i was violating the terms n i didn’t do nothing not only did my account with all my friends get deleted my other 2 accounts too its ridiculous cuz i got multiple people who account suspended for false accusations yall need to fix yall app this is beyond ridiculous i have memories on that account please give my account back thank you",
      "date": "2025-10-02T17:52:26-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Youraweridoinstagram",
      "rating": "1",
      "title": "Ban FOR NO REASON",
      "content": "I hate how you banned me for no reason just give me my acc back lil bro PLEASe 🙎🏻‍♀️🙏🏻",
      "date": "2025-10-02T17:40:12-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "JayJay__Lol",
      "rating": "5",
      "title": "Uhhh it’s okay",
      "content": "The app itself is okay the community toxic asl boom done",
      "date": "2025-10-02T17:38:44-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "-----help---------------",
      "rating": "1",
      "title": "iPad update: Auto scrolling stories is ANNOYING",
      "content": "This iPad update is TERRIBLE.\nPlease. Fix it. I can’t stay on a persons stories without going to their account. Stories are the only part of instagram that I use. This new layout is lame as well. The most “anti-user friendly” update ever.",
      "date": "2025-10-02T17:34:13-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Lolollilkikanab",
      "rating": "1",
      "title": "Dumb app",
      "content": "If you sign out you can’t sign in anymore it doesn’t even send a code to your phone number terrible service",
      "date": "2025-10-02T17:23:42-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Ale LLNM",
      "rating": "5",
      "title": "Good for business",
      "content": "Great for business ❤️❤️❤️",
      "date": "2025-10-02T17:18:44-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "kevin chuk",
      "rating": "1",
      "title": "Second TikTok",
      "content": "With the latests update the home tab is now nothing but reels and time wasters. I really wish I could control what I see and for there to be a dedicated ‘only pictures’ tab.",
      "date": "2025-10-02T17:15:58-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "I466ff4",
      "rating": "1",
      "title": "Wrongly disabled",
      "content": "I’m very disappointed with Instagram right now. My accounts (@indirahh._ and @yesitsdirah) were wrongfully banned even though I didn’t break any guidelines. I had these accounts for months with no issues, and then they were suddenly taken down. I’ve tried appealing but haven’t gotten any real help or explanation. It feels unfair because I see many other users with similar usernames and content who are not banned. Instagram should review bans more carefully and actually listen when people say they were suspended by mistake.",
      "date": "2025-10-02T16:50:59-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "iSpect8_",
      "rating": "2",
      "title": "I can’t go LIVE on Instagram",
      "content": "Please update to go to LIVE again on IG again please",
      "date": "2025-10-02T16:48:15-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "grace_t26",
      "rating": "1",
      "title": "banned for no reason",
      "content": "kindly reinstate my account. i have had it for 6 years. if not, please provide the exact reason and piece of media for which i was banned.\n\ni will fix the review once my account is back.",
      "date": "2025-10-02T16:45:57-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Stephen Githara",
      "rating": "1",
      "title": "Meta will ban you for no reason and has no support whatsoever",
      "content": "I have used Instagram for almost 10 years now and this past Saturday I was wrongly banned for CSE by Meta’s faulty AI system. Immediately emailed Meta and get no response. As of the time I’m writing this, a human being has not reviewed my account yet and I’ve exhausted all avenues of communication with Meta. I’ve even purchased Meta Verified to speak to Meta Support and still no one has reviewed my account to see I’ve done nothing wrong. This isn’t just happening to me, but thousands of accounts. Don’t get this app unless you want to get banned for no reason whatsoever.",
      "date": "2025-10-02T16:40:02-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "twglolulu",
      "rating": "1",
      "title": "Friends",
      "content": "I don’t like that instagram limit things of what I can see, like someone’s followers or following list that not very protect their community fix  that please and thank you",
      "date": "2025-10-02T16:32:49-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "tootltttes",
      "rating": "1",
      "title": "Account banned for no reason",
      "content": "Accounts are getting banned with no way to access support. Just Terrible",
      "date": "2025-10-02T16:30:11-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Aramesh rezvan80",
      "rating": "5",
      "title": "Aramesh",
      "content": "Rezvan80",
      "date": "2025-10-02T16:29:34-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Dumbassapp05",
      "rating": "1",
      "title": "Banned",
      "content": "Ya’ll wrong accused dnd banned people",
      "date": "2025-10-02T16:26:10-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "R - Meta",
      "rating": "1",
      "title": "Account wrongfully suspended",
      "content": "Instagram account suspended with zero evidence of any wrong doing. There is no way to refute any claims made. Please fix this issue.",
      "date": "2025-10-02T16:21:29-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "SSSChen",
      "rating": "1",
      "title": "Main page",
      "content": "Could you please have an option to make the pictures square again on the main page?",
      "date": "2025-10-02T16:19:45-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "vamshii26",
      "rating": "1",
      "title": "Suspended for no reason",
      "content": "Suspended for no reason",
      "date": "2025-10-02T16:11:36-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Seily Perez",
      "rating": "1",
      "title": "Account taking",
      "content": "YOU KEEP TAKING MY ACCOUNTS FOR NO REASON . And I can’t even keep an account for 3 minutes without you suspending it .",
      "date": "2025-10-02T16:05:54-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "aidan morin",
      "rating": "5",
      "title": "aidan",
      "content": "it keeps on suspended all my accounts for no reason",
      "date": "2025-10-02T15:47:38-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "hurrem16483",
      "rating": "5",
      "title": "топ",
      "content": "сейчас вообще все стало круче чем раньше!! огромное спасибо за то что фотки сейчас не обрезаются если их много, и алгоритмы в рилсах супер короче пупсики возвращайтесь в россию матушку💋🙏",
      "date": "2025-10-02T15:42:14-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    },
    {
      "author": "Daily.Homegrown",
      "rating": "3",
      "title": "Insta",
      "content": "Would be better if they didn’t limit the canna community and flag profiles limiting social interaction with peers",
      "date": "2025-10-02T15:34:09-07:00",
      "version": "400.1.0",
      "appId": 389801252,
      "appName": "Instagram"
    }
  ]
}